{
    "company_1": ["Cheap feeling plastic. Would compare to $12 walmart shoes. Absolutely awful.",
        "I have been buying the same shoe for the past couple years and they normally last me four to 6 month. After a couple of weeks the bottom of the shoe is coming apart. This is not what I expect from Under Armour.",
        "Hurt my feet all around, tried to add insoles and still hurt a lot.. had to buy new sneakers for work, not great for standing over 8 hours shift",
        "The product came dirty and damaged, a disappointment since it was a gift.",
        "Tread falling off after just a couple months. First pair I bought at a store was great. This pair (identical model/color) horrible. Moving to another brand.",
        "Los compre para correr y hacer ejercicio pero tengo inconvenientes porque el piso NO es antideslizante. Me he caido como 5 veces y ya las deje de usar. No te dan la estabilidad que requieres para caminar, mucho menos correr en cualquier tipo de piso.",
        "It does look bent in the picture that happened after wearing this shoes less than 4 months",
        "No support and they're not comfy at all don't wear for more than a few hours bought for work and after 4hrs my feet ache even with new insoles they're way to slim to made difference with the quality of what the shoe is made don't buy unless on sale.",
        "I bought these for a trip thinking plain jane just need a new pair of sneaks to get me through. I find them very uncomfortable so much so they created a blister in my heal. I would return but I've already worn them a few times hoping for improvement in comfort. Not happening. For reference I'm 6ft 225lbs. on to another pair of sneakers. Fortunately, not out too much money.",
        "Extremely comfortable shoes but do not last long. I did not abuse these shoes at all and the soles started to peel off the bottom of the shoes after about a month. I figured it was a fluke so I ordered a second pair and it happened a second time. I wanted to love these shoes but the lack of durability makes me go elsewhere.",
        "I walked for an hour in these shoes and the heel collar chaffed so bad that it drew blood. I also bought the \"extra wide\" version of this shoe and it doesnt fit any wider than the standard size.",
        "Comfortable, nice fit. Not a quality that lasts long",
        "The cloth is pulling out of the sole on the side after just a few days over 30 days, they won’t replace after 30 days. I would not recommend buying these as a waste of money.",
        "Title says it all. Shoe shouldn’t rip that fast.",
        "Definitely would not buy again the sneakers are falling apart in less then two months and all do is walk in them I’ve never used them for working out",
        "El zapato no se siente tan cómodo como pensaba, es rigido y poco confortable",
        "At first I really liked these shoes. However one of the shoes developed a hole in the insole in just 4 months at the ball of the foot below the big toe. Normal wear and tear I get but having that kind of issue in such a short period of time doesn't speak highly for the quality of the shoes. I have other shoes that do not have this same issue so it is not just an issue with stride/walking motion.",
        "The description says “fabric = leather” but they are actually an open weave mesh. Maybe not so great for winter wear….",
        "Bad product in spite of the brand name. They are too stiff in the center and with only 10 minutes of use cause pain in the bridge.",
        "I bought these for my boyfriend. He's a size 11 and when he wore them to work, he was uncomfortable. He thought it had to do with his socks, so he changed them. Turns out that these shoes just run small. It was too late to return them so we're stuck with them.",
        "While I like the appearance these are not optimal, they are too narrow compared to other size 12's. Additionally shoe strings are too short. I wouldn't work out in these because their is a movement for wider based shoes for feet health.",
        "I assumed that the shoe being a namebrand would be good, but it’s like walking onto concrete blocks. there is very little cushioning and Day 2 my back already hurts.",
        "These shoes suck !!",
        "I would rate these shoes higher, however, the sizing runs very small. I thought I had ordered women’s size for a moment when I first put them on. I’m a 10.5 and ordered 11. They are at least half a size too small, and for some unknown reason, the left shoe is tighter than the right.",
        "Hurting my heal. Jamming and cutting",
        "Not the same shoe as before.",
        "Cheap plastic feeling shoes. Ok",
        "Like everything about it",
        "This is my 3rd air of the Charged Assert style. Unfortunately, this last pair Delivered June 26th 2023 lasted me literally one month. The sole of the shoe is separating on the right foot. Quality is not what it once was.",
        "The bottom of the shoes started to separate from the shoe and started to cause me foot pain after wearing them to work.",
        "Mi pie mide 26cm exactamente lo que indica la talla del zapato 8 USA, 41 EUR y 26 cm sin embargo la horma de fabricación del zapato es pequeña y me quedaron apretados, super apretados. Es frustrante pq estaba esperando estos zapatos con muchas ganas y que triste no poder usarlos.",
        "My be well made but no padding at all",
        "shoes soal started to come unglued first. then the threads at the bottom started to come off. Still determining if they are nock off.",
        "You'll want inserts. Especially if you have flat feet.",
        "These looked cool but when they got here it looked like something a grandpa would wear not a middle aged man. Sent them back",
        "Integrity/durability of these is below sub-par. I've had them 6 months, wear them only 3-4 hours a day if that, & they became very uncomfortable before I even broke them in. The company nor Amazon would not offer replacement or break on a new pair. Long story short....in my opinion they are rubbish!",
        "La tela del zapato está mal cocida y mala terminación",
        "The media could not be loaded. Fue muy desagradable abrir la caja y encontrar todos los pelos por todos lados...dentro de los tenis, en toda la caja. Se veian sucios por algunas partes también",
        "I ordered in my size and I don't ever have to get a wide when I'm shopping in the store, but this wouldn't fit, it was way too small. Ended up donating without wearing.",
        "Shoe didn’t fit properly, both pairs were defective, sent them back via ups. 3 weeks now and still not a word from seller.",
        "I wore these for one day and they wrecked the skin on my ankle. Buyer beware. I tried multiple pairs.",
        "These are the worst fitting shoes I have even put on .the size is not correct width size..",
        "Long time UA customer and I am really shocked by my latest pair of Assert 9 sneakers. I bought a pair of the all black as well as the navy blue with white soles back in April this year (same time and order) and the one pair is literally starting to come apart 2-3 months later. I use both pairs regularly for walks around the block, walking the dogs, walking in grass, sidewalks, streets, stores, etc. About three weeks ago I noticed the front of the soles on the black pair were starting to separate from the sneaker itself and I just couldn’t believe it. Having worn both pairs pretty regularly, I haven’t taken them into any environment that would have caused this. Wet grass and actually a walk in the rain once (with the blue ones) is the most “extreme” weather and yet the one pair is just peeling apart…both left and right sneaker. Not really sure why and to be frank, I still have a very old pair of Assert 6 that I have put through the wringer with endless hours of treadmill time, sweat, machine washed at least twice, and even onto a dryer tray and they are still in one piece. Really bad quality or just defective? Who knows. It’s unfortunate because they are actually very comfortable, really haven’t been used long, and I only bought a couple pairs since my Assert 6 will one day give in. Damn shame. Please see the pictures. 2 stars as my blue ones are still holding out and hope they do for the long run.",
        "The size was too small, and my window to return the shoes passed by quick. Lost $50.",
        "Received my Under Armor shoes on June 7, and they're already tearing.",
        "Just a few days into wearing them and the right shoe is already falling apart :(",
        "Too small",
        "Purchased these a month ago for daily wear and they already have ZERO absolutely ZERO cushion left and my heel scrapes the back. Pretty annoyed that the price point is what it is.. for them to last a month.",
        "Certainly not the quality you’d expect from a pricey under armour product. Seams are noticeable and glue is present throughout the shoes, look and feel like $10 cheap wal-mart sneaks. Materials have a plastic feel to them, not very comfy, and exude cheapness. Embarrassing quality from a big company like under armour, and had to return as I was ashamed to wear such a low quality shoe even to the gym. I’ll stick with my puma, adidas, and asics for better fit and finish, better value, and certainly higher quality looks. Would not buy under armour shoes again, even at a deep discount like these.",
        "I purchased my child a pair of under armor shoes from Academy a few months back and he loves them. They are super comfortable and he wears them everywhere. I ordered this pair from Amazon thinking they’d be the same. I ordered a size larger but it compares to the same size he has now. The bottom of the shoe is awful, threading is tearing on top of the shoe, the laces were missing the plastic tip at the end to go through the holes easier. Not satisfied what so ever. I wouldn’t recommend. Unless I just got a bad pair.",
        "I did get the shoes at a discounted rate because I couldn't afford the new ones but I didn't expect them to be dirty and worn with dog hair inside them. I thought maybe some box damage or a scuff but these have literally been worn. The price I got them for should have been cut in half if not more. I wish I would have known beforehand. My son loves them and wants them so badly for school. I guess I'll just have to clean them up and lysol them.",
        "The shoes were definitely not new and had scuff marks on them. Bottom of shoes were dirty and a slight stain on top right shoe.",
        "The size was small I sent it back and I haven’t heard anything",
        "Have had them little over a month and the back plastic support piece that holds the heel up has broke so shoes are unwearable. Im not hard on shoes just normal walking wear did this. Don’t purchase.",
        "Been only using under armor for probably years or more. Got these 2 months ago and already falling apart. How do I get a refund or a new pair?",
        "The rear support for your heels are super uncomfortable. They dig in to the back of your heel until it’s raw. I thought I just had to break them in but that was not the case. The sneakers look great but contrary to all of the other UA sneakers I’ve bought, this is simply horribly designed.",
        "Shoes look good when received. I was a bit shocked at how stiff they were. Wore them for a few months got them somewhat broken in. Then I started having a sore hip and lower back pain. I just thought maybe I was sleeping weird. Until a guy at work asked me how I liked them, and I said I think they are good, and I mentioned the stiffness when new. He then asked if I was having any hip or lower back pain..... I said, well now that you said that yes, yes I have been, so that night I started wearing another older pair of shoes \"not under armor\", and funny thing is, my hip and back pain are gone. i wanted to love them.",
        "I only where these to the gym only I don’t where them all the time and this is already ripping",
        "Something inside clicks occasionally while walking. Could be a great shoe if everyone didn’t hear you coming - click click click",
        "I usually love Underarmour products, but the back heel support digs into my ankle. Thought I would break it in by running, but it gave me a painful blister. Maybe its just me though. Wish they’d make the back part a bit shorter cause I loved the shoe overall. This’ll set me back a few days/weeks :(",
        "Read Title",
        "I intentionally ordered a size double my size so the wood feel wider. I have a very wide foot.",
        "I intentionally ordered a size double my size so the wood feel wider. I have a very wide foot.",
        "Although they were supposed to be running shoes, the material of the sole was too hard that it was not cushiony for running .. It thud on the the ground like a dead mule",
        "They were not comfortable. I am a heavier man that's on his feet and they were not impressive. Threw them in the trash. Glad I didn't pay full price.",
        "Rubbed on ankle. Sent back.",
        "I got what I paid for cheap junk. Too small in the toe box, page has nothing for width's. Near nothing as of padding in them. I think if you would step on a thumb tack it would get you, they are that thin.",
        "Comfortable for strolling.  Heel is rubbing, blisters after 3 mile fast walk. Tried heel protectors and band aids, design flaw.",
        "Gave to my cousin as a gift. After 2 weeks inside right foot heel sunk in!! POS 😡",
        "The shoe brand looks fishy. The logo looked painted on. I will no longer buy name brand shoes from Amazon.",
        "Didn’t last long",
        "Decent buy for the price. But a little tiny soul base for the shoe size.",
        "The bottom rubber separates from the sneaker Horrible craftsmanship. Only wore for two weeks. Don’t waste your money",
        "Wanted some new black work shoes since I work outside. Ordered a size 10, came in on time- shoe box was damaged. These shoes run small, I’ve ordered a size 10 for the past I’m not sure how long, it hurt to squeeze my feet into these. However they are shoes, and they will work…… just not for me.",
        "wish i can return them, they are too small, i thought i could wait a while to see if maybe i would get used to the shoes and fit better, but now its too late and they are too small, i dont think it is possible to return??",
        "Shoes run small and the back rubs your heel a tremendous amount. Worthless for long jogs / walks.",
        "Los devolví al instante era una mala experiencia",
        "They hurt my ankles.",
        "These shoes are nice looking for sure. They do feel extremely lightweight. They are slippery though. That is a deal breaker for me. Will mot buy again for that reason and also they are a bit too lightweight.",
        "Bought this shoe at a steal. Looks good. Wears meh. Nothing spectacular and not particularly comfortable after a day or wear but good enough considering how low it was priced."],
    "company_2": [
        "Not big on how the look, but they are comfy",
        "me arrepiento de haber invertido mi dinero en esta porqueria de calzado, el pegamento se le ve por todos lados mala confeccion, lo que se ve en la imagen no es lo mismo personal, no vuelvo a comprar calzados de esta marca y menos por amazon, me siento estafada lastima no lo pueda regresar.",
        "These shoes are cheap garbage. They are extremely flimsy and have zero traction. Seriously, I slipped on carpet. They're terrible. The soles are slippery as heck and they feel like they're going to fall apart when I'm pulling them onto my feet.",
        "It looks like it should be more of a golden yellow based on Amazon... But it came in construction worker neon yellow. Shoe fits amazing. Just not the color I thought I was getting.",
        "The media could not be loaded. The sneakers are beautiful, bright color, I really like them, but the quality is not very good. The shoes quickly lost their shape. My husband wore them five times and didn't even machine wash them.",
        "When I received the shoe, it was full of hair particles in both shoes. At that point, I decided not to wear the shoes. I was disappointed. I know the whole try before you buy is good, but the shoes should be cleaned after someone else tries it",
        "That pair of running look bulky, thick fabric. No ideal if you looking for a running shoes that wrap your feet without giving them too much volume",
        "These are decent if you don't any kind of arch support. They seemed decently made and felt fine when I tried them on, but the bottom of the inside of the shoe was completely flat. I did like the design of the all around mesh look though.",
        "The shoes are comfy and fit as expected BUT the color is not what I was expecting, the gray is lighter than the pictures, I know pictures are doctored, but wow, they fooled more than I expected.  Almost forgot, the box was all smashed like they were wrestling with it.",
        "So cheaply made with cheap material. Very disappointed"],
    "company_3": [
        "They are not comfortable",
        "I worn a whole in toe area of this shoe within two weeks. Shoe material weak and poorly made. Would not recommend this particular shoe.",
        "This is a nice sneaker, unfortunately it was not sturdy.",
        "Looks great, comfortable, great price, but the material in the toe box is very thin and I blew out a toe hole in less than 3 months. Luckily Asics has an outstanding and very fair warranty program that they honor and I was able to replace my shoes for free, and actually get an upgrade because they give you a dollar amount to spend and better shoes were on sale at the time. Apparently the toe box material is an issue with this brand and their running shoes so buyer beware!",
        "Had to return as they were very narrow",
        "If the shoes are made in Viet Nam the shoes run very small. If the shoes are made in Indonesia the run very large. Good finding the right fit",
        "Too small",
        "These are good looking shoes but I have to return because while I purchased the 12 wide I’ve found the area between the tongue and the heel is about an inch shorter than the Venture 8 trail shoe… wanted something different but these just don’t work for me.",
        "The sneaker is comfortable so I’m pretty disappointed that there’s a hole in the top after only 2 months. Now I have to go and find something else.",
        "I have had these shoes for less than four months and they have developed a hole on the top of the shoe by the big toe. I have had this happen before but normally it takes a couple of years. This will be my last pair of ASICS",
        "1 month and 17 days of wearing pretty much around the store I work in and that's about the stressors on the shoes and BOTH shoes coming apart and getting holes around the little toe. CRAP PRODUCT GUYS! Do not buy!", "The material of the shoe is fragile and a hole appears in the toe. The sneakers are very comfortable, but the material gives way in the toe. It lasted two months. Is the second one I've bought and the same thing happened with the other.",
        "Tengo otras Asics Gel-Excite 8 y 9 y me quedan perfectas, no entiendo porqué esta, siendo la misma talla 9 y el modelo Gel-Excite 9 me quedan un poco apretadas y no las siento tan cómodas...",
        "I bought these shoes a little less than a month ago. I've worn them about 15 times. They already have multiple holes and tears in both shoes.",
        "These are lightweight and look great, but the material for the shoe tears easily. See pics",
        "Normally, love ASICS this shoe not so much. Not that great comfort I'm used to. Feet got hot and tired. Hurt some too. Sending back to try another pair fingers crossed",
        "Shoes took a long time to arrive not one of the best shippers. Shoes are good .",
        "The media could not be loaded. I ordered new ASICS and they were used, you can see very obvious defects and dirt.. not sure if they thought I wouldn’t notice maybe. But very disappointed.",
        "Flimsy upper but a comfortable shoe with decent support.",
        "Too big and thin material in front.",
        "These lasted less than two months! They were ran in ONCE. And only for 100 yards. The picture was after the run. One of them had the beginnings of a tear before the race. Amazon - will the company replace these? (Although not super excited about this brand.)",
        "Loved the shoe in person, looked just like the images online. The shoe sizing ran a little big.",
        "These were shoes for my teenage daughter. She only used them to wear at school but after a couple months the fabric at the top of both shoes because to wear thin near the toe line. We have no idea why they eroded so fast when the soles appear to have normal wear for a couple months of usage. I can't recommend as they're clearly not very durable.", "I've had the last 2-3 versions of Asics Excites and bought same size this time. The X-Wide is not even close to being a wide. Honestly, they hurt and I'll be returning if they don't loosen up very quick.",
        "the toe of the shoe is punctured, after 5 months of use.",
        "These shoes were picked by my child and purchased here. After less than 4 months of normal wear, I found that the shoes had several holes. From the place of damage, the fabric of the shoe is very thin and not strong. When children exercise, they have special sports shoes. These shoes are only used for walking. I did not expect the quality of this pair of brand shoes to be too bad. What is even more annoying is that when applying for after-sales service to the store, I was asked to send the pair of shoes back to the manufacturer at my own expense before deciding how to deal with them. You must know that $50 shoes need to spend another $20 in postage to be sent back to the manufacturer, which makes the entire shopping experience drop to freezing point.",
        "The shoes I ordered one black, I received dark blue shoes of poor quality that I will not pay to the seller.",
        "I have been wearing Asics for over 20 years almost exclusively. When I see the negative reviews about the top of knit lightweight shoes giving way to tearing and holes, I immediately roll my eyes and think \"hey dude; cut your toenails\"! However, I now see the light. These shoes are terrible and made of thin material with a type of weave that just tears. My toenails are trimmed and socks are thicker than I want, but I started seeing a hole after a week and reinforced it with some sewing and it just keeps getting bigger. I bought a pair of Brooks since and they don't tear (and are 1000 times more comfortable)? My older Asics never tore either. Buh-Bye Asics!",
        "I actually liked these shoes, the were very comfortable but the toe wore a hole it it after a month or so of wearing it. :(",
        "After only about 6 months of limited usage, a hole began to wear through next to the small toe of both shoes and a hole is now appearing above the big toe. Have worn Asics brand for many years and they have always been reliable and sturdy. This the first pair I have experienced a problem with so soon after purchase. They were reasonably comfortable for the price but I could not recommend this style based on the material and construction.",
        "After 3 weeks of indoor winter use, the soles look brand new and the tops are full of holes where the perforations in the fabric begin, running from the toe box to shoelaces. Both shoes are unwearable.",
        "Do No Buy Already Broken Poor Quality",
        "The media could not be loaded. Compre estas zapatillas a finales de septiembre de 2022 y solo las utilizaba para caminar, hace apenas 1 semana las comence a utilizar para correr 5 km y se rompieron, es una lástima, revisando vi reseñas que se rompieron por el mismo lugar, asique concluyo que es un mal diseño, no las recomiendo para nada, mejor gasten un poco más en un producto de mejor calidad, aunque no vayan a correr, igualmente se les rompera porque esa parte es muy delgada y se rompe muy fácil, aparte no tiene buena amortiguación, me da dolor de rodilla, cosa que no pasaba con mi anterior calzado.",
        "After only one week my toes wore holes in the material used to make the shoe. The fabric is very thin and doesn't take to wear and use.",
        "Disappointed in the 9s. The 7 and 8s were so comfortable but the 9s just are not the same shoe they must have cut on the foam or something. Shoe use to be great new version not so much.",
        "Wore a hole near pinky toe in less than 4 months, sole of shoe still has plenty of life left. Comfortable wide shoe, but doesn’t last, waste of money. Only wore for exercise and daily walks, not wore on an everyday day shoe even.",
        "historically, I have favored the Asics Gel-lites as running shoes, but now I use these for casual wear and walking. However, I have barely gotten eight weeks of wear and I have already developed a tear in the top of the shoe. Having always worn socks, I'm a bit disappointed that, other Asics that I have owned for many years are in great condition up top, but worn out on the soles, that these Gel-Excite have such cheap material and apparently no durability for normal wear. I do not recommend this version of the Asics.",
        "Not a bad shoe for 45 bucks",
        "It took my 10 year old son 1 month to make multiple holes in both shoes.",
        "Bought and used for running, frequently used but not a everyday use on them and they broke. Shoes usually last le years but the quality on this one is not great. Look good but they didn’t last. I wouldn’t recommend to no one.",
        "uncomfortable to train, feet hurt after training.",
        "I have bought Asics for years - however, this one started falling apart (with a hole in the toe) within two months of wearing them. These have just been walked in - no running, nothing intense. Disappointed. Will try again - hopefully this was just a fluke.",
        "The shoes are falling apart after only 5 months. The fabric is tearing away from the base of the shoe. My pair before these were the Excite 8's and those only lasted 8 months before having to replace them.",
        "Shoe runs very small.",
        "My son really liked these, at first. Fit was great, very comfortable. Then after wearing them 4 times (he’s very careful and keeps shoes nice) the fabric started to unravel on the top. Very disappointed in the craftsmanship of this shoe. Will not be purchasing Asics again.",
        "I’ve ordered this shoe multiple times for my 11 year old son. He loves them for everyday use and for running team that he does after school. Usually this shoe tears after a few months of wear, with holes at the pinky toe area and inside ball of foot. This pair had holes after 3 days. Really unfortunate since they fit him well.",
        "Too narrow",
        "Nice shoes but i tried them on once, and they broke. For the price i cant ask for more but i honestly expected more.",
        "Shoe fits great, feels great but as with many ASICS shoes, I now have a hole in the toe area of the shoe after only having it for 6 weeks and only using the shoe for casual walking (no running, no other sports). I do NOT recommend this shoe. This was $60 wasted.",
        "The right shoe doesn’t feel like it’s made the same as the left shoe…the insole seems to small for the shoe",
        "Llegaron en bolsa, no en caja. Y por lo mismo todos aplastados",
        "Al cuarto uso en caminadora se rompió la tela superior",
        "Bought these and they fit ok but did not last more than a few months of light wear..... very poor quality.....",
        "Very poor quality...not durable at all.",
        "I order this from Australia and it was delivered from USA. My size is USA8.5 and it turns out to be much larger than any other ASIC running shoes I purchase before. I don't know why have such a different. When I click the button to return the shoes, it further ask me to charge delvier fee for more 20 dollars. I purchased other ASIC running shoes in Kogan.com.au. much cheaper and more options and suitable size. Extremly dissappointed for such experience !!",
        "C’est que j’achète plusieurs paire de chaussures ASICS par année",
        "De qué sirve que llegue con el numero equivocado? Y no daba la opción de cambiar por el número correcto, pérdida de tiempo en todo el proceso de envío y retorno.",
        "Producto ok por el precio."],
    "company_4": [
        "This shoe was awful…Extremely poor workmanship….Literally no inner lining…My feet severely hurt after 2wks.",
        "I just walk in these with socks. Within the first 10 times I wore them, one of the insoles fell apart. The other shows no wear.",
        "I bought these for work shoes. I’m a big guy. I think they tried to put arch supports in them, but causes your feet to slide to the side and walk on the outside to your feet. It’s not comfortable when you’re on your feet all day like that.",
        "The shoe itself is great. Very comfortable and durable. The insole is terrible. It must be a new design because the last pair I purchased did not have this issue. The insole is now made of a biodegradable foam material and it does just that in the shoe. I played tennis with this shoe twice, and by the second time the insole was shredded in the toe box.",
        "OMG yes its light and all but its not comfortable type light. it has bad grip too and it just feel like a cheap material. its flexibility is decent. good for running but others are a no no no. hiking is not recommended and neither is working out on it.",
        "After one week, the insole is falling apart. Not impressed.",
        "Good luck sweating in them. Worse shoes i ever wore, even compare to 99 cent store ones. This is the first time and last i buy from this brand.",
        "The media could not be loaded. Soles falling apart after a month of ownership. Horrible quality",
        "Ahh definitely could be $10 cheaper than $42",
        "Probably the most uncomfortable shoe I have ever bought.",
        "Bought these shoes they are comfortable but the inside is falling apart not even a month old ! Guess you get what you pay for.",
        "The media could not be loaded. I only wore this shoe a few times including 1 boxing class for the right shoe’s sole to turn to dust. The shoe was comfy up until the boxing class, where I guess too much pressure on the toes completely ruins the shoe sole. Very disappointing, but I guess that’s what makes this a cheap $ shoe.",
        "My 86yo tenant said they were too small for him...mainly due to a need for a pedicure. As such, returning for a different pair that are larger.",
        "The recycled soles are hot garbage. The shoe itself is fine and is comfy for the first 2 weeks or so then the soles will start to come apart inside causing you to replace them.",
        "Estos tenis llegaron con otro tipo de plantilla, no es la negra con las que viene las originales, además es una zapatilla bastante dura y no se siente cómoda al usarla. La verdad no parece una zapatilla original.",
        "Uncomfortable and unbreathable but nice looking",
        "inner support is foam and starting coming apart immediately",
        "inside if shoe ripped after a month of use",
        "I expected something better, but in the end it is wearble and quite comfortable.",
        "I ordered my shoe size, but when they came in they look and feel like they’re a half size too big.",
        "The shoes are not comfortable because the bottoms are very hard",
        "After 14 days of wearing these Adidas (cheap) sneakers the insoles basically dissolved.",
        "The shoes seemed great, but after a few runs the sole on only the right shoe tore apart and now the right foot is very uneven an d uncomfortable when wearing them and running in them.",
        "They fell apart after some months of use. Not a regular used maybe 2 or 3 times every 10 days. The rubber of the sole its detaching.",
        "after just a couple of months of normal use, they started to fall apart, mainly the sole and the insole, which started to disintegrate. Don't buy them, at any price", "even though it's comfortable, I need a clean one. Probably will return this one",
        "One of the worst shoes I’ve ever bought. Falling apart within a couple weeks and uneven",
        "The inner soles disintegrated. Just trash simple trash.",
        "No contaba con unas plantillas los tenis deberían mencionar que se compran por separado.",
        "I received worn, damaged shoes! How is this even possible!",
        "Shoe is very comfortable and I had second thoughts on buying an all white shoe but I’ve grown fond of it; until, the stitching below the tongue began to unravel. Unfortunately, I’m two days pass my return date. Very disappointing.",
        "It's really sad. I ordered and got these because I liked the previous pair I bought. Now I'm stuck with a useless pair that I can't wear!!! the shoe lace pieces that hold the laces came off, two of them. I finally took them to a shoe repair shop 8/04/23and he sowed them back for $10. I picked them up 8/10/23 and wore them. Then this morning I put them on and tried to tie them and guess what?!!!!!! TWO MORE CAME OUT!!!! What kind of crap is Adidas making these days?!!! I'm back to my old Adidas with flat bottom soles!!! I'll NEVER BUY shoes with this type of shoelace wholes!!!!!... Also, I thought Adidas was a quality brand, I guess this is what I get for thinking!!!!", "I've worn Adidas running shoes for the past 10+ years, and have never seen a worse design. The insoles are made of the cheapest material I've even seen in a shoe, and on top if that, the shoes themselves are way heavier than the previous few Adidas shoes I've bought. Overall, totally not worth it, even if you get them on sale.",
        "Just not really that good. They are just cheaply made and just really really ugly.",
        "This is probably my fault for not doing more research, as I own a different color of this shoe and loved them so much I picked up the ones in the pic thinking they were black. The color says ink, I guess in my head I figured there is such a thing as black ink, as that is the color I wanted. Have had them home on a shelf for a few days and inside my dark house I also thought they were black. Wore them out today and suddenly noticed that they weren't black, but rather blue instead. I like the fit and how they feel, but feel really disappointed that they weren't the color I thought they were. Kind of wish I could return these for a different pair now. I wear a lot of dark clothing and thought these had the look of classic Adidas, but they really don't. Just wanted other buyers to be aware and look up the color from the description before you buy... Oh and the box was beat up pretty bad in shipping. That doesn't bother me but others may have an issue with that sort of thing...",
        "Style was cool,but was very uncomfortable. Insoles were very hard. made my feet hurt",
        "I hated the tongue on this shoe. It was too big and boxy and made of some cheap foam that felt like it was going to absorb any sweat or moisture and turn these into the stinkiest shoes you can imagine. Beyond that, I wasn’t too impressed by the shoes profile or how it felt when wearing.",
        "Last two pairs of shoes ive had for work were adidas. I would in healthcare so am on my feet all day. Two hours into my shift and my feet are starting to hurt. Im 5’10 and 185 so weight isn’t causing foot issues nor have ever had problems. But these shoes are terrible. Very uncomfortable. They have a feel of a half sphere in ball of the foot.",
        "I got wrong size of shoes . I ordered 7 size they put 8. 5. & more interesting that they gave me original packed for 7 size but inside product of 8.5.",
        "These shoes offer absolutely NO protection for the front of your foot. Paper thin material feels like a sock when walking around and there is a lot of unstable movement from the sides. No support for under the front of your feet either. Plenty of cushioning on the heel but the front feels like you are barefoot. These shoes are just horrible, the feel like you are only wearing half a shoe.",
        "Didn’t love these compared to all the other adidas I buy/ wear. Admittedly I’m hard on my shoes, but within two months I’d worn a spot on the sole to where they’d bubbled and cracked leaving them useless. Will spend more money for a better quality shoe in the future",
        "They are comfortable and seem to be holding up well for me. Only time will tell",
        "These sneakers have no support whatsoever",
        "I use these as a casual walking shoe. Just out of the return period I noticed the inner soles fall apart. Unfortunate.",
        "They don’t have much arch support or cushioning.",
        "Very narrow.. the insoles feel like theres a hump right in the middle of your foot.. oh well live and learn I guess..",
        "The insoles were not even attached to the shoe. Immidiatly noticed from looking the insoles had a large lump, investigating further both insoles were completley disconnected from the shoe. found out they were not even connected at all \"glue\" was already completley worn out right out of the box. Very unhappy with this puchase. Buy your shoes at a store they go through your own quality check. Gonna have to buy some dr scholls insooles, ehich i guess is every pair of shoes these days 😪",
        "They just feel awful and generic especially for the price, no matter how hard you tie them the heel feels like it’s coming out of the shoe so running feels absolutely horrendous overall just a bad shoe",
        "Typically don’t have an issue with adidas, but my husband hasn’t even had these shoes a month and the insole crumbled up and is destroyed.",
        "Look good. Fit good. Great for walking or even light jogging. But the insoles are made of some sort of egg crate biodegradable material, and they break apart. On the inside they boast about no more plastic - great but I still need something that lasts a little while. I’ll have to put aftermarket insoles in them.",
        "It runs short, not very comfortable insole, and difficult to put on.",
        "I bought these for my husband for Father’s Day. He has only worn them 4 times. He has only worn them out to dinner (cause I got him the white pair). The inside fell apart. Literally crumbled. He has to remove all the padding inside and replace it with shoe inserts. We are very disappointed!",
        "The media could not be loaded. Not sturdy. Lace strap tore after 2 runs.",
        "The insoles got completely destroyed after 2 months of wearing this shoes… only wore them twice per week and look at this… pretty much look at me I’m a nice pair of shoes but don’t wear me…",
        "These have been the most uncomfortable shoes I have ever had. Will not order again will not recommend to a Enemy.",
        "Size is too small for me",
        "Was hoping they’d break in and of course after realizing they would not Im past the return window which expired yesterday smh. My fault I guess. On the outer part of the footbed of both shoes it’s a huge lump, as if the arch is incredibly exaggerated or there was a manufacturer error, incredibly uncomfortable even just to stand in. Sucks because I love the design. Oh well I’ll keep them for emergencies and or very short term use I guess. Anyway if you get some like this make sure you don’t hesitate to return as they will not break in.",
        "The media could not be loaded. I bought these for my 14yo son to use for weightlifting for football. He has worn them 5 times. 1-3 hours each time. Not to play in or mess around. Strictly used for weightlifting. They didn’t even do any running. The insole is disintegrating. You can hopefully see what I mean in the photos. While this is not a huge deal, and I can hopefully pick out the rest of the insoles and replace them, this is ridiculous for 5 days of use. I’m not going to bother to send them back since the outside of the shoe is still brand new looking, but I would not recommend buying them.",
        "The shoe outside was ok, comfort wise, not too bad. But I wore these to work maybe 6 times and my toes wore through the foam inside (I dont work that hard) The inner part of the shoe is pure junk. I had similar Addidas that were really good so I guess I expected more here. Sketchers of a similar style that I bought at the same time didn’t look quite as good, but performed much better and were more comfortable.",
        "These are not my daily use shoes, after a 4 hours drive the insole started to disintegrate.",
        "Fell apart after not even 4 months",
        "Pros: Really comfortable, light and breathable, nice and simple design  Cons: Super hard to keep clean. Don't hold up well with intense sports. I used them for pickleball, and they started getting worn down after just a few months. Soles wore out, shoestring snapped, and a hole started forming on top of one of the shoes.  These shoes would be great for just lounging around the house, but they failed as athletic shoes.", "Very uncomfortable. There's something wrong with the arch support. It's like almost a metal pushes the arch up. I couldn't walk as they hurt. No recommended.",
        "I have had a pair of these for the last year and they were amazing. I ordered a second pair because I liked them so much…. BIG MISTAKE. The last pair are horrible. The insoles disintegrate and are very uncomfortable. If you receive these and they have the white/tan insole, send them back!",
        "The insole made out of so-called recyclable materials is peeling off and disintegrating into sand-like particles after a week of wearing. Now I have to buy for insole replacements.",
        "These are literally damaging my feet after few hours. Glued insoles means you can’t put in something more supportive. Overall foot posture is too forward balanced. About the only good thing I can say is that they are light.",
        "These look white in person and had spots on them out of the box which was disappointing.",
        "I hardly ever write negative reviews, but this one is an exception. I only used these shoes for a couple weeks, when the insoles began breaking apart quickly… And I wasn’t running or jogging in them. I attribute their breaking down so fast to the fact that they are made out of recycled items… Something I didn’t realize when I purchased them. I’ve been wearing Adidas shoes for several decades, and have never had issues like this. To make it worse, I contacted Adidas to try to get my money back, I jumped through all the hoops, but they would not give me a refund because they said it was normal wear and tear. But since I’ve owned a lot of Adidas shoes, I know that it’s not normal, wear and tear for shoes to break down after 3 to 4 weeks. I imagine many other people have had similar problems, which is why they’ve slashed the price in half. I was more disappointed with the Adidas Customer service than the shoes… You would think that after somebody has invested thousands of dollars in a company over several decades, they would refund you on a bad product.",
        "I got these a few months ago. They are decent shoes. In my opinion the pictures are slightly misleading. The shoes look narrower in the pictures but in person they are very wide. For $50 they’re very comfortable but the wideness of them can be very off putting. If you like wide shoes I’d say they’re worth it, but if you don’t I would pass on them.",
        "The cork insoles fell apart on these within a month. The same thing happen to the last pair of the same brand. No more cork, for the love of God!",
        "The shoe is very comfortable especially for a wide foot but the sole breaks down after only a few weeks. Not worth the money.",
        "A little to light weight",
        "They look great, but the insole started falling apart with less than 2 months of wearing.",
        "I should have read more reviews. I received them and the left shoe insole was not attached. I tried to push it in there, but it appears to be for a larger shoe and doesn't even fit in there. I just requested a return. Poor quality for what I have always thought to be a good brand. I will keep shopping. I like the design of the shoe and overall feels well made, but the cheap insole that just says \"Reduce Plastic Waste\" on it and not even a brand or anything is garbage.",
        "Everything about the shoes looked good except they too wide.",
        "Probably owned 20+ adidas over the years and this one is just straight garbage. Absolutely destroyed after a month of wear. Stay away and keep it moving.",
        "Unless you want an-stiff sole, maybe take a pass on this one",
        "I returned it’s expensive",
        "Not the standard quality I’ve grown accustomed to on adidas. Inserts are falling apart after light use and they don’t fit the same as other adidas tennis shoes I’ve owned.",
        "Even though the shoe looks white rather than gray, it's still a good looking shoe. But, it's too wide and I ordered the same size as my last pair of Adidas (8W). If you need really wide, this shoe is good for you."],
    "company_5": [
        "I bought these to use for everyday wear at work. I had them for 3 months before I had a hole in the mesh of the shoe by my toes.",
        "I really liked the fit and lightness of these affordable running shoes but after only wearing a handful of times (just light jogging) it developed a hole by the toe area even with clipped nails. The mesh feels paper thin there. My mom had the same shoe just for walking and had the same problem with it. Now the return window has closed and i had to by different pair.",
        "Ripped after a couple of months",
        "I've bought this exact same shoe, same size and color, from a store and these run a half size bigger. I'm keeping because they are comfortable I can wear thicker socks.",
        "I hate to write this review because I liked the sneakers so much but after only two months of wearing them they developed holes in the toe box. I only wear these for my daily walks (average about 5 miles a day) and only on regular roads, just over the two month mark I noticed that their was a hole in my right sneaker. Of course I was out of my return window at that point but I called and Amazon is going to accept a return because of the defect. These were wonderful while they lasted.",
        "I got the shoes in April of this year and they already have a whole and a second one getting ready to break through. They're not even used for heavy duty.", "I bought these shoes mid June as recommended by my podiatrists due to plantar fasciitis. Although it comes with orthopedic insoles, I used my doctor recommended ones instead. The heel provides extra cushion so it's a more comfortable walking shoe. The material however is not very durable as on both shoes, there is already a tear from the outside where the pinky toe sits. I've barely had these shoes for 2 months and I will already have to purchase another so I will probably look for something a little longer lasting. These were every day shoes for me, perhaps if I only used them for the gym they would have lasted longer.",
        "I won’t run in these again but use them for aerobics",
        "I’ve use this brand for years, I order the same size and width, and they do not fit as good as they used to. They are a little longer and rub at the heel. Sad to lose a dependable shoe.",
        "I did my due diligence while shopping for these shoes. They had such good reviews, I really thought they would be a good choice. The size was perfect. The toe box is roomy, the back of the shoe hugs the heel nicely, no slipping. My complaints - these shoes are stiff, and hard. The insole is hard with very little arch support. They are comfortable enough for a short walk, that’s about it.",
        "I love the padding that Asics have and they're so comfortable in the past but this pair the tongue is almost too small. This pair I get tiny rocks in my shoes. Kind of a bummer.",
        "I wear ASICS all the time. I have bought these same shoes at least twice a year of about 10 years. This model sucks with in a week the backs are completely broken down!! I bought these ones and a gray pair and they both suck!!! All I can say is stay away from this model!!!!! Gel- Excite 9 is crap",
        "These are bright blue. Obnoxious bright blue. Photos of very deceiving.",
        "I like ASICS because they fit my specific women's 10.5: not too wide and generally have a comfortable back. This pair are too floaty or soft or something like that. Maybe not enough structure around the instep. I wore them so I'll keep but not recommend.", "I have ordered these shoes twice. The first time I thought it was a fluke that I wore a hole in the toe within the first 6 months, so I ordered them again. It's been 6 months and I have another hole in the toe. Definitely not worth the money.",
        "These shoes are okay in comfort once I place support inserts in them .... the problem I have is the heel area is so thin, one must untie, and sometimes use a shoe horn, to ge them on without the heel fabric collapsing.",
        "The wide width is not very wide at all. I had to return them. I'm disappointed.",
        "The back tongue of the shoe points inwards and was causing really bad blisters on the back of both my heel in less that 15 minutes of wearing them from my car to work. Just awful. My poor feet, spare yours and try another brand. Pay attention to how the back of the shoe is shaped!",
        "My shoe size is a 6.5 and I always get a 7 in running shoes. On a petite person this looks like an 8 or 9 because of how far out the sole protrudes.",
        "Me quedaron pequeños y son talla 8 normalmente",
        "When you walk you feel the bottom sole. I’m a nurse and a few days my feet hurt. Okay for just a few hour of wear, which makes them just okay",
        "Too small in toe box I have been getting this style for years and now with this generation it is too short in the toe box and I run into the front when I run.",
        "looks nice , but not comfortable",
        "I really wanted to like these shoes. But I had a bad experience with them. I have had them for less than 2 months and the fabric at the tip of the shoe is already ripping. I love the comfort of the shoe. They wear great for long periods of time, but like I said, the top is ripped and now I have to get more shoes.",
        "These are a great pair of supportive shoes that absolutely helped me with foot pain and back pain. Unfortunately I did not listen to the other reviews about the mesh on the top of the shoe tearing after a short time. My pair lasted a little less than a year (mostly used for walking, elliptical, or HIIT workouts a few times a week) before the mesh layer on the right shoe wore out. If this is a product you can afford to repeatedly repurchase, I would recommend it. If you're looking for a shoe that will last longer than a year, I might try another shoe.",
        "I swear by Asics. Love them for walking. Unfortunately, the material will tear at the toe in time. It only took 2 1/2 months this time. Very disappointing.",
        "I ultimately returned the shoes. The material was so thin they were see through. I ordered the white ones and maybe the others are not see through but I imagine they are just as thin.",
        "I have been wearing ASICS gel excite for years and size was consistent. The model change the Excite 9 is nothing like previous. The shoe was at least two sizes too large. I wear 9.5. Looked like a man’s shoe. Very disappointed. And previous models like the excite 7 or 8 are not available.",
        "Son cómodas. Bonitas buen material.o malo la parte del talón horrible .se boblan y cuesta ponérselas.",
        "El tennis es muy bueno, pero a pesar de que he comprado esta marca de tennis antes, este modelo me quedó muy Justo en la parte de alante.",
        "They looked great and were comfortable, but only lasted 2 months before getting holes.",
        "Very dissapointed. I take a size 8 1/2 wide and these are way too narrow to be a wide.",
        "After 3 months of wearing this sneaker there is a hole in the toe. This has not happened to me with any other pair of ASICS, it’s the only brand I buy.",
        "Not the quality I remember from them.",
        "No real arch support.",
        "I like ASICS, but these shoes are very flimsy. The mesh upper is so thin that you can actually see a clear outline of my toes. They simply would have holes in them in no time if I kept them and wore them. The fabric is simply not durable enough for running shoes, and it's puzzling why other people who rave about this shoe don't see the problem with them. I've owned other pairs of ASICS running shoes in the past and none of them were made with this kind of cheap, thin material. These are not\"quality\" running shoes.",
        "I love these, ordered my usual size and could hardly get them on. They're so tight around the middle of my foot that it cuts off circulation to my toes! May need to order up a half size!", "I rarely write reviews but I think its worth mentioning that these shoes make a lot of noise. they make an audible squeaking noise when i walk (still 2 months after I bought them). They are worth the money but don't have the support or strength to provide adequate running cushioning, but would probably be fine for the gym.",
        "Didn’t like them they gave leg cramps and they look big on the foot",
        "I thought they would be more comfortable,I will keep them,Because I need them at this time.",
        "Too wide I kept anyway because I wanted white would not buy agsin",
        "I put these on and the heel discomfort was immediate. I've been paying more for Brooks Ghost for years (and going back to them). Naturally you get what you pay for. I'm on my feet as a server for long hours. These shoes didn't even make it out the door.",
        "I mistakenly bought the wrong size sneaker and doesn’t fit like the ASICS Gel Excite 7. Most of the excite 7’s were sold out in size 9.5 so I decided to try the ASICS Excite 9. There are nothing like the Excite 7. I returned them and was lucky to find an Excite 7 in size 9.5 which made my day. I love the ASICS brand because there sneakers are very comfortable and lightweight and allows for longer wear during my work hours. I didn’t want to leave a one star as it was my mistake in purchasing the wrong which was way too big for my feet.",
        "I don’t wear sneakers often and bought these for work use after knee surgery. Nice looking shoe, but bottoms of my feet weren’t overly happy in them: not enough bottom cush and support.",
        "I bought these shoes thinking the thick sole would help with heel support. I’ve used them off and on for the last few months and they are painful!",
        "I need to return these put a scan bar back on here an were I take them I have tried an just not comfortable after foot surgery !!!! ???",
        "Usually my favorite brand. These don't have as much support as the running shoes I usually buy.", "These sneakers are less then two months old, only warn a few times As you can see in the pictures and they are getting holes in the front. I would not recommend these to anyone. I'm very disappointed in that I can not return them because they were purchased over 30 days ago. Amazon will not allow a return.",
        "ASICS has lost its quality",
        "I ordered up a half size as I was planning to use for running and it was very tight in the toes and my toes were at the end. Order a full size up maybe? I returned and dis not re-order",
        "The shoe runs small and the wide width is not as wide as a normal wide width in other brands. I returned the shoes. Went to Dick's Sporting Goods and purchased a pair of Brooks.",
        "Bought these two months ago and they already have a hole in the top where the shoe fabric is coming apart. I do not use them roughly or extensively, typically just for treadmill use. Do not recommend.",
        "I've been a loyal customer of these shoes, probably 10 pairs so far. I buy a new pair of Gel Excites every few months. This new model 9 has widened the toe box so they are no longer suitable for narrow feet. Just like Hoka, New Balance and Brooks these are now much too wide. I'll be shopping for a new favorite shoe.", "I hate these shoes. Unfortunately I missed the window to return them. They run small, so they are very uncomfortable, and they are also hideous. The pink color--in my opinion--doesn't look as good as in the picture. They look like shoes for octogenarians.",
        "I have had this shoe for less than 3 months. i really liked them when I got them but now there is a hole pushing through where my big toe is on the left shoe. It is too late to return them or get a refund. Very disappointed.",
        "They are comfortable but recently gave me blisters on the the back of my feet partially my fault due to wearing a low sock. The rubber on toe is also already coming apart two weeks into wear.",
        "These shoes are supposed to be Gel 9 but they don’t say gel 9 on the shoe and say ortholite. They are not comfortable like my Gel 7 ASICS and are giving me blisters.",
        "I typically love this brand and have been buying for the last 10 years as my athletic shoe. I have had this particular pair for less than two months. The cardboard/plastic piece that sits behind the right heel/Achilles tendon (inside of the shoe) began sagging down and will not come back into position. The shoe is now very uncomfortable and slips constantly during exercise. I am unfortunately now outside of return window. I have never had this occur in my other athletic shoes... Bummer, I can no longer use when running/walking.",
        "I normally love this brand of sneakers. They’re comfortable and durable. But for some reason this “model” developed a hole in thet shoe after one week of use. The shoe is still comfortable and serviceable, but very disappointing to look down and see my sock instead of the intact upper at the toe of the shoe.",
        "Very narrow, but the size was not narrow. I have been wearing Asics in the same size for a long time. It threw me that these were so narrow. They also weren't that comfortable. The insides were hard. The best thing about this shoe is the color. I sent them back.",
        "Tore near the toe region within 2 months. Cheap quality product",
        "Disappointed. No support.",
        "SEE UPDATED REVIEW BELOW ... I needed a pair of shoes for playing outdoor pickleball but the shoes advertised for pickleball are problematic. If you read through the one-star reviews on pickleball shoes, you'll read over and over that the tread wears within months, that the side support (which is a must in this sport) is lacking and they're uncomfortable to play in. And most of them are around the $100 price range. So I tried these Asics running shoes instead. Turns out this gel-excite series is made to keep your foot more centered on the shoe's platform and to reduce the overall weight of the shoe. It does both and the side support is fantastic. I play up to 3 hours a day and have absolutely no pain in my feet when I'm done. ... UPDATE 6 WEEKS LATER - I liked them so much that I bought 4 more pairs for my family members (in the men's and children's version too) and every single pair has the same issue: HOLES in the upper material. And they're not just in one spot. The holes are all over. So although they are very comfortable, we need to find different shoes that last longer than one month.",
        "I am definitely a fan of this brand but not this sneaker. I have had these for about three weeks. Although initially comfortable, I found myself purchasing a moleskin liner this week in an effort to protect my toes from the friction caused from inside which was noticed after a 5 mile walk. Too much hassle for a new sneaker. I will be returning them and would avoid this sneaker.",
        "I need good cushioning for my long walks. These feel great for casual walking, but when I walk over gravel, the cushioning isn’t strong enough.",
        "While I initally liked this shoe, the wear and tear is absolutely horrible. The back of the heel is completely crushed down from slipping them off and on and now I have to throw them away.",
        "I loved them at first but didn’t even last for 3 months before getting holes. And those 3 months were low-average use, not even 3 times a week.",
        "These shoes feel very cheap. The support is awful. Feels like your walking on pebbles.",
        "I bought these to replace my Gel Excite 7's, which have lasted me about two years before the treds and inner sole degraded. First off, I ordered an 8 W and found it to not be wide in the least. While I appreciate the extra cushion around the ankle, the sole support is greatly lacking, even more so than the 7s. While the soles are replaceable, the top shoe material, which is extremely thin and stretchy, is not; because the shoe is not wide enough, my toes were pushing pretty heavily against it, and I can tell it would cause blisters on my toe and tears in the material within a couple wears. Maybe it was for style and comfort, but the top material is sure to wear out quickly for anyone wearing these for walking or anything other than sitting. The shoe looks great, but functionaly not worth the money. Highly recommend the Gel Contend 7s, though!",
        "Horrible quality- hole already in the fabric and barely worn and not even more then a few months old",
        "I got these shoes in the middle of December two weeks ago I noticed a small hole well now there’s 4 holes I wear them for walking I wore them about3 days a week because the rest of those days I was shoveling snow not with them on so very disappointed",
        "These shoes are comfortable but they get holes in them within 3 months, 3rd pair of them and same thing, I keep hoping for better luck but not happening!",
        "I purchased these shoes, hoping they would help relieve some of the pain from my plantar fasciitis, but they did not. Every time I wear these shoes my foot hurts even worse days after. I also have a bone spur on top of the plantar fasciitis. Overall, I would not recommend these shoes for someone with either of these conditions.",
        "Updated review. Hole at the big toes. So disappointed. Won’t buy again.",
        "Asics changed the design from Excite 8 to Excite 9 and the updated version gives me blisters. The padding collar behind the heal is much thicker and rubs me wrong. Initially the shoes felt fine but over time this problem became very noticeable. Be warned if you loved Excite 8. These shoes have changed.",
        "These shoes we’re comfortable but did not hold up.. they had a hole in the front after a few months of part-time wear. Bummed!",
        "I love these sneakers. They do fit and are totally comfortable however the fabric by the big toe wears out way to fast. I think they need a bit of a thicker mesh so they will last longer. I purchased these in the Fall of 22 and they still look great except for the holes by my big toes :-(",
        "Got a refund for them not being “new”. But they were also uncomfortable! I work in retail and walk in concrete all day. After 2 weeks, I had to buy new shoes. Hurt my feet!",
        "After less than 3 months both shoes have holes at the toe area. Need to buy new ones already. I’ve never had shoes do this so quickly and always buy ASICS.",
        "Already has holes! I’ve only been wearing these a few months and they already have holes"],
    "company_6": [
        "The sizes are extremely small",
        "The shoes seem very comfortable but run a half size to a whole size too big.",
        "Están bonitos pero esos errores no pueden pasar esperar tanto y que te llegue mal el pedído",
        "I bought this shoe and I am a little disappointed because it wore off really quickly. The shoe is very comfortable and very lightweight. The shoe size fit as expected. But the reason I gave it low stars is because within 2 weeks the bottom of the shoe sole wore off really quickly. The tread of the sole went immediately flat. This is the first time I have ever seen fast wearing a shoe. I used these shoes on a daily basis for about an hour a day when I go jogging. Once again very comfortable and lightweight but wore off within 2 weeks.",
        "I had these shoes for about 12 hours. The first time I wore them, the side lace strap broke. Needless to say, I'm returning them! This is completely unacceptable. Obviously a defect since this happened almost as soon as I put them on.",
        "I wear a 12.5 wide in most shoes and also wear orthotics for pronation. Typically, I can wear 13 medium in Adidas. Unfortunately, these run narrow and the insoles, which have little support, are glued in and can’t be removed and replaced.",
        "Bought twice. First time wasn't marked wide at all. Second time box said wide, shoes did not and were not wide. Disappointing.",
        "the yellow strap broke...so the shoes are pretty well useless....the strigs are now tangled up",
        "The shoe is super comfortable and looks good. Problem is the same for me as everyone else, the sole wears out and I'd be shocked if it lasted even one year. Sadly I won't be buying another pair solely due to them intentionally designing these to intentionally wear out fast so you buy another. These imperfections with products are not accidents, it's designed to maximize profits as I'm pretty sure Adidas has a little experience in how to manufacture shoe soles properly after all these years. Very disappointed to see this tactic (or design flaw is possible). Fix the sole and we have a truly great shoe, now if you'll have a great shoe, but only for 3-6 months max.", "I was really looking forward to wearing these. they arrived today, I couldn't even get my foot into the sneaker. I am a size 11, only half my foot fit. very disappointed !!!!!!!!!!",
        "I originally purchased this shoe and another white Adidas shoe because I wasn’t sure which one I’d like more. I ended up not being a huge fan of the shoe because it looked different from the photos and the lace on the shoe looked unnatural to me. I ended up returning the shoes because of this issue and Went with the other pair. The shoes were comfortable to wear, but I cannot get past the word they look so that is probably the biggest reason I ended up returning them.",
        "Same labeling as on my white ones (same model), but wrong size, much bigger -doesn't fit.",
        "I was very disappointed in the Adidas lite racer 4. I loved the ease of wearing the lite racer 3 and expected the new model to be an improvement somehow. Not nearly the great experience the older models provide.",
        "The shoe is really good and comfortable. Because it is cloth type meterial and if it's get dirty you can't clean it.",
        "Running and working out",
        "Compre los azules y son falsos… mejor comprar los que aplican para pagarlos después",
        "The sneakers look like Bozo the clown shoes. Lol. I returned them",
        "Can't even get your foot in!",
        "One shoe was wider than the other one. Not happy with these shoes.",
        "I should have read more reviews. I saw a high rating and went for it, but I was ultra disappointed and returned them.  Despite the fact that I ordered a \"wide\" I was completely unable to even get my foot in them. If this is ADIDAS' concept of wide, I would hate to see their normal shoes. It's not even just due to them being high tops, I wear regular with high top Converses all the time, but I guess the shoe laces make them easier to loosen up and put on.  Very disappointed. They looked like they would have been comfortable!",
        "Some of the narrow shoes I purchase in a long time…",
        "I bought these for my son a couple of months ago and he started wearing them a couple of weeks ago. They have already come apart, causing the leases to become loose. I would like a complementary pair , refund, or credit.",
        "I really liked these shoes. They are comfortable and they look good. But my problem is that it's been less than a month 5/11 - 5/29 and already the tread is almost gone on the pad of the foot portion. I'm not standing and twisting around on my shoes grinding it down either. I had another pair of adidas shoes do the same thing before these. They just don't last and it sucks cause I really do like these. I'm gonna have to buy another pair of shoes within the next month to replace them. You gotta make a deeper tread or something so it lasts longer than a month. My hey dudes which I wear regularly have lasted much longer than these and those were cheaper and I wear them as much as these. I don't think im that I'm that heavy of a guy to wear it down that much if my other shoes don't look like this. I'm not really expecting much from this but I guess for some buyers beware if your looking for something to wear everyday and not necessarily occasionally.", "Hard to slide on. Too tight in area of black material on sides. Wouldn't recommend.", "I have a pair of the 4.0 version of these shoes that I wear around the house, and they are perfect. They are super comfortable, easy to take on/off, and haven't worn out or stretched out at all. I wanted another pair for wearing out, and figured I'd try the 5.0 version. This shoe, in the same size, is the most uncomfortable thing I've ever tried on. There are sharp pieces sticking out from both sides in and around the ankle, and I wasn't able to keep it on my foot for more than 30 seconds. These are getting returned.",
        "Nice looking shoe, but too small of an opening to fit a foot in. All 3 men in my house tried with no success.",
        "I have to wipe these down every single time I wear them and they still dont look clean. They are comfy thought",
        "Runn small",
        "La horma es pequeña, suelo usar 11.5 y eso pedí, pero debí pedir un wide o 12 para mayor comodidad.",
        "Odd fitting",
        "I love the lite racers and have bought about five pairs over the years for my 10 year old. He loves them because he can slip them on and off so easily. These were difficult for my son to get on and off and the ink on the adidas logo began to peel off within a week. I think they may not be the real thing. :(",
        "Returned, the fit and comfort weren’t there anymore. It also felt cheaper. Sad",
        "It’s impossible to put on without a shoe horn. Fits well once they are on. Returned.",
        "I really like the look and style of this shoe with the blend of four colors (Black, white, grey and blue). Only problem is the sizing, my feet measure between a 10.5 and 11 (US) with the in store foot measuring tool. Having already tried on the size 11's in store and being just a little too tight, I had to order the size 12's online. Received the order and could not get my foot into them! Something is off with their sizing of this particular style as my old shoe's in which I have 3 pairs are all 11's and fit perfectly.  Style is 5 stars but fit is a 1 star.",
        "I’ve only had these shoes for 60 days and the soles are worn down to no traction already. Soles are made out of super soft material that don’t last. If the ground is wet, they are slippery. They are super comfortable, however, but wouldn’t recommend unless you’re okay with buying new ones every 6 months.",
        "I wear the 3.0 version and decided to buy the 5.0. Where the 3.0 fit my feet correctly the 5.0 squeezed them and it was an uncomfortable fit.",
        "Don’t recommend to buy. Comfortable at the beginning after short period of time start fall apart",
        "These were clearly worn by someone before. There are scuff marks on the bottom and sides, and marks on the laces. Not new.",
        "The ad, decryption and box all described these shoes as WIDE. But nether the tag nor the shoe itself are wide.",
        "Stylish and comfortable, however, had to return the first pair as they run a half size too small",
        "Size 14 and they runs super small , squeeze my toes",
        "I am pretty sure these shoes are for the European market because the arch area is way too small. About the third time I have ordered shoes on here and had this issue.  Amazon not checking that items they are shipping are made for the US market is massively frustrating",
        "This product was to small. Still have not received refund after returnimg.returning. Please correct this problem. When i called weeks ago i was told it would be taken care of.",
        "I purchased the black grey and white shoes. So excited because it's my husband bday but when it finally arrived, inside were the wrong shoes😓. The shoes are nice though but I wished I had gotten the shoes I purchased.",
        "Great shoe but not wide enough even though I ordered wide.",
        "I ordered a \"Wide\" and it came to me as a 14. Thus, the width is pretty snug. I am not sure if the wrong shoe was sent or there is no wide as pictured when selecting.",
        "Ordered size 8. And got it much more narrow then 8 size usually is. Also lack of ability to adjust tightness of laces makes them very uncomfortable to wear.",
        "Like the look and comfort of the shoes. They are my dailies due to being quick on and off but stay secure even with the occasional run. They are great shoes but I was disappointed in the durability/traction of the outsoles after only five months of use. They are now super smooth and I skated with them recently during rainy days. I take good care of my shoes so the upper still looks new but I can't do much without grip. Not much value if I to replace them after such a short period of wear.",
        "I should have listened to the reviews! I thought since I was buying these for my 11 yo they would fit....nope! Not even close! I got them in the black/grey/grey. Idk if the fit is different in other colors? Returning:(",
        "These shoes are poorly made. They were fairly comfortable but broke after only 2 days of wearing them.",
        "The sneakers are extremely tight to get on. Had to use a show horn. I do not have a wide foot.",
        "Low quality shoes. I would return if I could.",
        "Good fit, I like how you can slide them on and just go. comfortable shoe. unfortunately, 5 months later. The stitching is coming apart in one shoe in one pair and the inside of heal is ripping out of the other pair. Wish they lasted longer.",
        "No wiggle room at all. Just suxx",
        "I ordered a 13 wide and could barely get my foot inside. Then it was very snug around my ankle and the top of my foot. It felt like some of the dimensions were probably carried over from smaller sizes (a QC issue).  I usually only need wide sizes for my toes -- wide sneakers are often too loose around my heel/ankles. That makes me think the size for this shoe was just off -- like the 13 wide was done wrong or something.",
        "Says Navy Blue but they are purple as can be........ make sure you are getting what you pay for.",
        "The ribbon on the side keeps breaking. Not worth the price as I no longer can use the product once the ribbon breaks.",
        "They are very tight around the ankle, not wide width as expected.",
        "This is the 3rd pair I have bought. The black ones, which read blue. The white and gray. I love them. Then these came and broke my heart.  First day wearing them and they break. Smfh",
        "The shoes look nice, but the opening is so small I couldn’t even get them on my feet. I don’t think the jaws of life would have even helped me. Since these don’t lace there is no way to loosen them and there is no stretch to get your foot in. Definitely don’t recommend for people with a high instep or thick ankles. Disappointed.",
        "I ordered a size bigger and in WIDE and the shoes were still too small. My son couldn't even get his foot inside the shoe.",
        "Won’t be ordering again, size is not accurate.",
        "Ordered several adidas slip on type shoes before, this one was way too narrow. Returned, will try again. Loved the color",
        "These shoes look amazing. No tongue or laces to worry about tying. Unfortunately, the soles are too hard and caused my arches to hurt. I will be returning these. I am extremely disappointed because these are really nice looking shoes!",
        "These shoes run small and narrow.",
        "My husband wears a men’s 8.5. They were extremely tight and we had to return. Length fit perfectly..",
        "I couldn’t find my usual 3.0 so tried these. Way too much thickness and cushion for my person preference, makes the bottom of my feet burn.",
        "I have bought 3 different versions of this shoe. The oldest was very comfortable so I bought two more. The next is tight so I currently have it on a shoe stretcher. I do not know if this pair would be comfortable as the opening so small I can't get my foot into it.", "This shoe is amazingly comfortable for the price yet I couldn't understand the mid-low price range for it. Ordered it, my size, which is 10, adidas never failed me, perfect -but- after a week of wearing these they expanded to almost 1 to 1+1/2 size up. I now must insert foot insoles to make up for the gaps so it doesn't feel like they'll be coming off, they fit better now with the insoles but they still feel way too loose. Oh well. You be the judge. Go half size smaller, I would say a full size smaller, but then again half smaller would probably do the trick.",
        "No me agrado porque no es original y esta muy mal fabricado",
        "Too small.",
        "Supposed to accommodate size 14 wide foot; opening in shoe is way to small to allow foot to slide in. You’ll rip the rear tab trying to pull it on and since the laces are non functioning and the shoe doesn’t open, the fit is not as described. Poorly thought out. Discontinue selling this shoe. This is an Adidas Folly. Surprised and disappointed with a well reputed company and product.",
        "They look cool, but I can't slip my foot in them because the hole is so small. No bueno!",
        "I have the 3.0 and love those shoes. However, the width on the Wide 5.0 is VERY disappointing, definitely not a wide fit",
        "The thread used to sew the Adidas label on the tongue is a serious skin irritant to the top of the foot where the label ends.Hopefully the manufacturer will reconsider this design flaw in future versions. As for me this one goes back.",
        "Its alright",
        "Shoes nice but way to tight on top and middle of my foot feels like circulations getting cut off and I already had to deal with returning one pair and don’t feel like having to do it again so guess I’ll just keep them..",
        "Very difficult to put on. They have no laces",
        "I wanted to update my review. This shoe sucks. It gets very durty easily and also has some kind of suction cup that forms as it wears due to the poor tread design. Every step I take has a suck sound and gets stuck to the floor a little.",
        "I've tried on at least 10 of these shoes now from different online stores and actual physical stores, no pair is the same as another. It's generally the soles which are bubbled, causing pain to even attempt to put them on much less walk. If you're lucky some fit right and are comfortable, but less than 10% are manufactured properly, visible differences in size & shape from shoe to shoe. If you want to try these my suggestion would be to order 4 or 5 in batches just to see if you win the lotto and get a properly made pair, then return the rest. Adidas quality control is that horrifically poor.  They're in this cringey recycled packaging that make them feel cheap, but you know Adidas probably feels amazing saying they're saving the environment while slapping the MASSIVE egotistical Adidas branding on the front of the shoe, it looks disgusting, vomit inducing almost."],
    "company_7": [
        "I've been hunting for a black running shoe that is lightweight and looks simple enough to wear casually as well as on a run. Basically, I want double duty for packing light. This shoe has a simple streamlined look, is lightweight, and works as a casual shoe well. It's terrible as a running shoe, or even a walking shoe. There's almost no support and the interior seamline rubs blisters on the arches of my feet. If you're looking for a shoe to run in, this is not it.",
        "These shoes are lightweight and cute, but there is no support.",
        "The fit is great, but there's hardly any padding with the inserts they came with. Personally, I wouldn't recommend.", "These offer okay support. I don't understand the fantastic reviews though. The padding on the inside doesn't go all the way to the edges of the shoe wall around the toes and you can feel the seam. I don't have wide feet, and yet my big toes and pinky toes were partially off of the padding, causing rubbing and discomfort. I'm sad because I thought these would be great. Definitely going back.",
        "These shoes didn't fit my feet well so I sent them back and received a $30 \"restocking fee refund deduction\". That is absolutely ridiculous.",
        "This is a nice shoe, but I had to return as didn’t like the material. It was all cloth, and I felt they’d be filthy all the time.",
        "The shoes came with some dirty stuff in it. I am disappointed.",
        "Love these shoes but they run a bit small and tight. I recommend ordering half a size to a full size bigger. Regular size 6.5 size ordered 7 Regu",
        "These shoes are wide and uncomfortable. Not sure if I got some kind of knock off or if these are really Adidas. In the arch it’s like the shoes were stitched weird. Not happy with this purchase.",
        "I’m sorry, but not what I expected. Barely any support and tops are paper thin.",
        "Trendy and, for me, missed the support and comfort mark. Sent them back.",
        "I mostly like it. I like the simplicity of the style. It is a slip on tennis shoe...that was a surprise but I like the slip on. I don't like the fact that it has very little arch support and the bottom of shoe is fairly thin. It's not meant to wear all day cuz lack of arch support and thin bottom.", "I wanted a comfortable pair of shoes, be prepared to squeeze your feet into these shoes there's no thongs on these shoes they are a bit tight. So be aware of that when buying a pair!",
        "width fit fine but they were too long past my toes",
        "Cheaply made, very little cushion, insoles about two sizes smaller than the shoe, not comfortable for extended wear. Would have returned if I had not recycled the packaging. Thought it was a trustworthy brand before this purchase. Bypass!!",
        "I love these shoes but the soles do wear down fast.",
        "These are so cute and I wanted so bad for them to work, but the quality is just not there. Just an hour at the and my feet zoo hurt so bad. Just no sole support. The sides are comfy so it's not a breaking in issue.",
        "These shoes are extremely comfortable but also extremely difficult to put on which makes me hesitate to chose them. Good choice if you are going to want to wear them all day for being on feet for long periods of time.",
        "Not good too hard",
        "For a \"cloudfoam\" shoe I feel like the insole is lacking on comfort. I can also feel the edges of the insole which is just slightly annoying. I love the look of the shoe just wish they were more when it comes to comfort.",
        "Bought less than two months ago. Mesh fabric is ripping. I don’t wear these shoes often and had a pair previously that held up really well :-(",
        "This is a nice looking, lightweight sneaker but it has no arch/foot support. The Inner sole is very thin and does not reach all the way to the front of the shoe. It is not good walking shoe if you are planning to walk for a long time/distance. Disappointed in Adidas. .",
        "Received fake adidas shoes. Tag was fake, stripes on only one side of shoe.",
        "Unless you're wearing brand new clothes from the store everyday.. these shoes will look out of place. They're very white and bright. Stick out like a sore thumb. Hopefully the return process goes smooth. If so I'll be buying black instead",
        "These are super cute but run about a size to big.",
        "These had such high reviews so maybe it's just me. I wore these for maybe 2 hours before I started to get a blister. The backs of them are not comfy at all.",
        "Black adidas cloudfoam pure 2.0 Bought as a gift and like 3 months later, I casually find out that the receiver gave them away because the right foot was IRREGULAR. Totally unmarked listing and box. But apparently right foot was stitched narrow. Definitely bought and sold by Amazon not third party.",
        "I always wear an 8 including other adidas shoes. When I got these I noticed there is no separate tongue to the shoe, the upper is all one piece. The problem is the opening to put your foot into is so narrow that I can't even fit my foot through. Disappointed and returning.",
        "The size ran a bit small",
        "3 stars for the cuteness of the kicks. Would have bern 5 stars but they sent the wrong size and its such a pain to return and the fit is fine.... not perfect but passable. Very bummed about the error.",
        "I loved the looks of these shoes but the tongue is sewn to the whole shoe. I have a high instep but rarely find a shoe I cannot fit into. They are adorable but they wouldn't let me get my foot in shoes. Womens size 9.",
        "I have been wearing these for 1 week. While they are incredibly comfortable, fit well to my foot, and are great for my office job the left shoe has started to fray and fall apart at the seams! I am so mad to have spent the money on these shoes only to have it fray and become ruined in a week! I haven't done anything differently to my left shoe versus my right shoe. In fact, the right shoe is still in perfect condition. Anyhow, beware of buying shoes from Amazon in case you get a pair from deep in the backs of there storage. I have found that my past few orders of name brand items have all been a bit \"off.\" Also, learn from my mistake and start wearing the shoes the moment you get them so you can actually return them and get your refund. Super disappointed in both Adidas and moon with this manufacturing issue and there willingness to ignore me when I asked for an exchange.",
        "Returned. I was hoping for more cushion.",
        "Shoe laces are weird to tie kinda hurt my feet but other than that their good",
        "These shoes feel very cheap. No cushioning in them at all. I was very disappointed.",
        "I work with children and I’m on my feet 8 hours and I absolutely love them. I’m going to buy 2 more pairs exactly the same just to have.",
        "Was too small",
        "Comfortable shoe. Bought them for easy slip on during pregnancy, once I got into 3rd trimester I couldn’t put these shoes on by myself anymore.",
        "Buen producto, buen precio, lo único que no me agradó es que no llegó con la caja original, era un regalo.",
        "Not as comfortable as the ones I bought previously. My old ones still had the tongues that are their own piece (not attached at the sides) so they were much easier to slip on.",
        "I use these sneakers for Jazzercise class. They are a little difficult to put on, no tongue in shoe",
        "I bought these in my typical size 8.5. I could barely get them on when they arrived. I exchanged them for the next size up, still had issues getting them on, I felt like I needed a shoe horn. I tried wearing them on a walk and I felt like my feet were going over the soles. I have wide feet and these shoes are made for a narrow foot.",
        "Walking! My fingers couldn’t help me . Had to return them!",
        "I love this shoe. However, after only 6 months of use it has developed holes in the sole. The fabric on the inside heel had also torn and the built in shoe-horn has cracked.",
        "The foam for which they are named stops before the toes, so they are not as comfortable as a lot of reviews suggest. That is the main reason I bought these shoes, so they were disappointing. The laces are thin and cheap looking. The shoes themselves are cute, hence the two stars.",
        "Poorly made, do not look good to wear.",
        "Are these real Adidas?? I purchased two pairs of these shoes in different colors years ago. They were the most comfortable shoe I’ve ever worn and I wore them for years with that comfort never changing. When I received this order of shoes I immediately noticed differences in the shoes I had before. These shoes are difficult to put on due to the narrow opening and no way to adjust(loosen) them. They wrecked my heals and the bottom of my feet the first time I wore them. The insoles don’t even cover the entire inside bottom of the shoe leaving my feet to rest up against the very uncomfortable inside sides of the shoe. Definitely don’t feel like clouds! Do not like them and if I had not bled all inside the shoes from the blisters I got in less than an hour of use I would be returning them. Will not buy again and do not recommend!",
        "Never received product or a refund for the product. However, I love my other pair I have!",
        "I was so excited to find these in Amazon but honestly, they are the cheapest feeling shoes I have ever worn. I always were a size 7 and these are so loose on the sides, the rubbed my bone raw on a 10 minute walk.",
        "These shoes are lightweight and comfortable, but I have a hard time wearing them for too long. I have really high arches (you can see the bottom of my feet when I'm in heels), so these shoes can be hard to put on and take off since you just slip your feet in. I can wear them just fine to exercise, but after about 45 minutes, I can feel the shoe digging into the top of my foot where the arch is highest. Not a great fit for me, but they're very cute.",
        "I do have a very high arch and could not get my foot into shoe, so I have no other opinion on durability or performance.",
        "The fit is perfect but I am wondering whether they are the real thing or knock offs. The material is thin and the sole seem plastic. Like knock offs 🤨",
        "The fit is fine but there is ZERO support or cushion for the heel and arch, which is one of the MOST important thing in a walking sneaker. Not worth the money at all.",
        "This product was advertised on sale. I ordered and it offered a 7 day period to receive and try it on before purchase. It never said the price would go up to full price. I love the shoes and would likely have purchased it again if I did not feel mislead.",
        "If you don't wear socks, or even if you do there is stitching right in the inside of the arch. This sticking is VERY rough and sticks out. I had them on for 2 seconds and I knew trying to wear these would result in terrible blisters. Also these were not as \"fluffy\" on the bottom as my last pair.",
        "I returned these shoes. Very hard to get on so I'm not even sure if they are comfortable. The tongue is a solid piece so it doesn't give. You need a narrow foot or a pair that is too big.",
        "Bought these shoes for running but the right toe box made them uncomfortable and hurt my feet. They have little to no support. They’re lovely and light and I use them for walking but I won’t be doing any running.",
        "Attractive and comfortable. But I could feel and see my foot (which is not wide) stretching the upper at the edge, which is such a soft and unstructured material that it acted more like a slipper than an athletic shoe. For that reason I returned it.",
        "Purchased this shoe for travel because I thought it would be comfortable. Unfortunately, it is cut very high and is hard to quickly get on and off. Would not be ideal for dealing with TSA etc. It was very comfortable just not for what I wanted it for.",
        "I find this sneakers to look and feel cheap",
        "They hurt the top of my foot and the back heel. Also very hard to put on due to narrow opening",
        "There is absolutely no support for workouts or running in these shoes. I was really disappointed in Addidas.",
        "These are not the adidas cloud foam. They are so uncomfortable, I can’t even justify keeping them to wear around the house. I have Adidas Cloud Foam in several colors and bought these during prime day only to be disappointed.",
        "I’ve had these shoes for 3 1/2 months and they are already falling apart.",
        "You get what you pay for.",
        "I got for basic work shoes but I can’t take soles out. Lightweight and comfortable if for looks and short time wear, tried for work and running and would not recommend.",
        "These are a HUGE failure. No where NEAR the Adidas known quality...NO WHERE NEAR. Literally had them on for less than an hour, its like walking on thick cardboard. Trust me when I say.. DO NOT WASTE YOUR MONEY. I am FULLY EXPECTING refund AND compensation for the OBVIOUS DECEPTION.",
        "These are not adidas. I got them on prime day for $30 so they will do, but I would not pay full price for these! They are very cheaply made.",
        "Fit was about right, but not much support and were cheaply made",
        "Opening is so small I've been wearing Adidas for years and I'm disappointed, literally cannot wear them.",
        "Practically has no bottom to it. I might as well have worn a sock. No support at all",
        "I own adidas ultra boost in a size 6.5, and they fit perfectly. With these I had to size down to a size 6 as there was a lot of space at the toe. Otherwise great stylish shoe. Very very lightweight.",
        "I’ve always been a size 9. That’s what I ordered, and my toes are right to the top and uncomfortable. I have to return these unfortunately.",
        "I ordered a pair last year and they were very comfy and i’d worn them out. I attempted to order a second pair during prime day and was sent the completely wrong color and wrong type of shoe. Seems like they just threw whatever pair that said adidas into a box so now i get to drive to a drop off location and return. Very inconvenient and wont order again!",
        "Poorly made across top of foot. Shoe is made to come way to high across the top of the foot with no tongue opening. Poor design.",
        "For something reason my shows arrives dirty and wonr don't bus this prodcut",
        "I thought they were very light weight and cushiony.. but toe box is too small. I usually wear an 8 but these are too tight",
        "Nice light weight shoe but very hard to put on.",
        "The media could not be loaded. It's light weight and nice looking. No cushioning on the inside, the mouth of shoe not flexible so, it's hard to get my foot in the shoe.",
        "I loved these shoes. I have had 4 pairs. And this pair was not the same. Different size and quality. Returning them"],
    "company_8": [
        "La talla y la calidad están bien pero me enviaron un color diferente al que pedí",
        "bought a pair of 10s they ran big like a 10.5 11…so I returned them for a 9.5 hoping they’d fit like a 10 well the 9.5s fit like an 8.5 figured out there was a reason why they DISCOUNTED THEM to $40 be prepared to be disappointed if you buy them",
        "The shoes were fine, but not what I wanted. The photo I based my choice from, was the blue shoes, but the description (which I didn't pay attention to since all the others coordinated with the picture) said they were grey. I didn't realize the picture didn't match the description until I opened the package. This is very misleading. They are nice shoes, just not the right color.",
        "I ordered these for my son in black and we received gray with green. They look nice but not what we ordered.",
        "Well made. Nice looking. But, this was second pair different color bought at same time, and this pair was extremely uncomfortable. Pinched my big toe. Calls into question manufacturing QC.",
        "The shoe was fine, it was the same brand and design, it was just a completely different color scheme than the one I ordered.",
        "I wanted a different color, but it was sold out. The size is good and I’m getting used to the big Under Armor logo. They kind of look a bit dorky, but a lot of shoes do right now.",
        "I wear 9.5 and my right foot is squeezing me in them. I pray over time it will get loose.",
        "These are super comfortable, but they literally just disintegrate as you wear them, made of weak fibers.",
        "Very unhappy They look and feel plastic",
        "These shoes are a well made, solid product. However, they run small so you’ll need to buy a half size up from your norm",
        "Item was full of cat hair",
        "Not a good one.",
        "Mala calidad .. le compre a mi esposo y en menos de un mes se despegaron…",
        "It already tore up",
        "No good",
        "Il start with the shoe is actually not bad. It’s a good shoe. This review is intended for the company. First they send me a the wrong size (clearly) there fault. And I have to pay to return. Okay not the end of the world then they send me another pair, and this one comes with a dirt stain on it. It’s a white shoe. Sour taste in my mouth. The shoes decent but I’d find someone else to order from",
        "If you are an American male with wide feet order one full size up. I wear a 14 XX wide and thought I would be ok ordering a 14 in this shoe. Not at all… should’ve went with a 15.",
        "Size was not correct after measuring like they said on the size chart 1/2 size to big. The box was in very bad shape will be returning for the correct size",
        "Order size 13. The tag says 13 but actual size is a 10. If you order these get a size 3x bigger. I gave these to my 14 year old son instead of sending them back.",
        "Bought these shoes brand new they arrived with stains on the left foot shoe. I have never worn them the stains were right out of the box. Not going to return as white shoes easily get dirty just confused on how that happened.",
        "It doesn't look like the picture. It is light weight, but feels cheap. I think it is boring and ugly in real life. Not worth the money. I would have kept them if they were $20, but over $50 is ridiculous.",
        "The shoes tread was worn and dirty. Soles were scuffed. Shoes already had a crease where the foot bends. It looked like someone wore them for a day or two and then returned them. The rest of the shoe was clean but cheaply made. The mesh is similar to plastic. Bad shoe. Bad experience. Will never buy under armor from this seller. Might not buy under armor from Amazon again…",
        "The shoe doesn’t look like the image. It looks slightly more low profile. It reminds me of a grandpa shoe. It is comfortable and lightweight so it would be good for working out. The style is just not as expected.",
        "Please see the photo I've uploaded and compare it with the product pics and video.  These are fundamentally a decent pair of shoes, comfortable and do what it says on the box. That's not the issue. I was looking for understated, matte-like finish and the pics and the product video made them look like they met my requirements.  Alas I ordered them, and they've arrived as shiny as they are, attracting everyone's eyes to the shoe. Defeats the purpose I bought these for, and more importantly, misleads buyers with false marketing. I shouldn't be surprised but UA? seriously?",
        "I’ve worn nice shoes, and I’ve worn cheap shoes. These feel like cheap shoes that someone slapped an under armor logo on. Also, if you’re a stickler for detail they visually don’t directly match the pictures listed for the shoe style I bought. The only reason I don’t want to return them is because they’ve got the under armor logo, and returning them and finding a better pair and waiting to receive another pair is too much of a hassle, so I’ll wear them until they wear out. I’m dissapointed with under armor on these, i feel scammed. I do not recommend buying these to anyone. Find something else.",
        "It was not worth the price",
        "5 stars for the snickers and zero for the delivery. Worst delivery by GAASH WORLDWIDE and Buzzer. Both operates in Israel. Lowest service standards. I expect Amazon Never again use them. . Out of hundreds of deliveries throughout the years those were with no competition the worst. .",
        "I bought two pairs. One came in original UA packaging and the other came is brown shipping box. So unsure if it’s new.",
        "The shoe's sole is hard. I wouldn't buy it for running, maybe to use in the gym.",
        "Side of shoes got holes super fast",
        "muy bonitas, pero me llego con izquierdos y de diferente modelos,",
        "El zapato no es lo que pare en la foto muy mal producto",
        "These are some of the most uncomfortable shoes I have ever worn. Almost zero padding on the inside and the sole made out of a solid, hard almost plastic like material.",
        "Not supportive on your feet , but other than that they are j",
        "Not comfortable; too short in the toe box by about a 1/2 size. And they look somewhat clunky on feet. Disappointed, given the many positive reviews.",
        "Hard, blocky and rough. Feel and look like generic store brand shoes.",
        "The inside of the shoe reeks, it took about 3 ish weeks and it started getting a bad odor , now i'd say it was me if my feet stunk or if i didn't change socks but..not the case and it's progressively gotten worse.",
        "These are ok shoes and for the money maybe good. They are light and fit right. Not overly supportive and not too much in the way of cushion. But like i said you get what you pay for.",
        "Love the shoes. But after wearing them for a while they fit too tight",
        "These would be great shoes, but are poorly built. This is the second pair I've had that the eyelet in the middle has ripped while tying my shoes. It's beyond the return window, but I've barely had the chance to use them 6 weeks.",
        "A fair value at half off but would not have been happy at full price.",
        "I bought these on prime Day and they are way too small. Now I will have to pay regular price which is double.",
        "I’ll give it this, it could be an okay gym shoe for lifting, but you’d have to pay me to walk or run in these. The sole in these just don’t support how you’d want.",
        "I love the look and feel of the materials and the light weight but I had to send them back as UA shoes seem to run a bit small. I usually take a 13 or a 12 1/2 wide if available but this 13’s we’re not if enough for my Freddie Flintstone feet. A 13 1/2 might work but is not offered (by pretty much anyone). I refuse to go to a 14 for fear of societal ostracization, ridicule and the real possibility of being unable to mate.",
        "I dont even wear these shoes that ofter and rarely to do anything active. The tops look new and I used them so little you can see the grips on the bottom havent worn, but they are peeling off. I dont think I've purchased a shoe thats started to fall apart after such little use.",
        "In one month shoes got torn. I never seen any other brand shoes ever get torn on top part of the shoes. Very disappointing with under armor brand. Usually, shoes get ripped off on front bottom part. In this case it torn on top part of shoes.",
        "On my second day of wearing these, the toe kick started peeling on the left show. Light/office use",
        "Not confortable enough to work out in the gym much less to go running. They are of good quality and looks good to hang out with friends, but not for excercising",
        "The assert 9 model fits way better as far as under armour shoes goes",
        "Whereas the soles on Surge 1 and Surge 2 were ideal in terms of comfort and traction (although they did wear down rather fast), the soles on Surge 3 are quite different, being a more rigid composite material, leaning towards plastic. While the longevity of a pair of Surge 3 is probably significantly extended because of the change, beware of walking with these shoes on a wet tile floor -- you'll be slip-sliding. No more pairs of Surge for me. Sigh, I had considered them my favorite shoe ever.",
        "Talla pequeña no como se esperaba",
        "Bought these for my brother and the top of the toe part ripped in one week",
        "Great price",
        "This is an Honest review about this shoes Under Armour..i bought this because most of the good feedbacks.but then i used it,most of that comment are not that helpful..FIRST is about the \"Comfort\".i own 3 running shoes(Nike,Sketchers,NB).all this mention brand are very comfortable to wear.the inner soles are so soft.never had a Heel Pain.but then i used this Under Armour for a week,my Heels are painful during and after 8-10hours of walking/standing in my work.now i have to buy an Insoles just to make it softer.SECOND is the \"Size\".i normaly wear Size 9 on most of my rubber shoes.but their size is bigger.about half inch bigger.so if you wear a Size 9..u should get 8.5..and THIRD and important one is the \"Outer/Lower Soles\"this shoes is very SLIPPERY.specially on Smooth/Wet surface like Tile floors and Metal Floors,unlike my previous shoes(Nike,NB).i never had a slip on those floors.but there are few Good things in this shoe,like the Price.($50 incl.tax)compare to Nike's and NB..and its light weight.hope this will help those who are planning to buy this to think twice about this shoes..hope this comment reach the seller too..will not buy Under Armour again.",
        "Okay",
        "Disgusted with sale. Items wrong size, too small!!",
        "Uneven sole, thank you for making my foot hurt.",
        "Beautiful shoe, can't get the size right, inconsistent.", "Wore men's size 8 in under armour, but this time it was too big. The lining on the insole degraded after a month.",
        "Husband tore them up wearing them in his warehouse floor they didn’t last a month",
        "Shoe is comfortable. Has to be a knock off the stitching is horrible",
        "Very comfortable Great price",
        "ich fonde den Schuh für die Größenangabe einfach zu schmal andere Marken in der Größe sind super",
        "Not for distance",
        "These seemed to be made well with quality workmanship. However, where the tongue was sewed on there was a lot of extra material that dug in to my son's feet. It was too uncomfortable for him so we had to return.",
        "La scarpa è bella ma la misura in larghezza (pianta del piede) risulta molto stretta, troppo stretta. Porto il 43 ed ho preso un 44 ma restituito subito.",
        "Good looking running 👟 Good price but the bottom of the 👟 front and the back are uncomfortable they are not soft at all center is soft.",
        "As long as you don't mind rolling the dice on what colour they'll ship you, the shoes are decent. I guess I'm lucky I didn't get pink?",
        "Las zapatillas están bien para su precio tampoco se puede pedir más. Tallan bastante justas. El envío de Amazon no pudo ser más cutre, era la caja del producto con un celo mal pegado y las etiquetas encima, por suerte eran para mi hijo y no para un regalo.",
        "Gleiche Schuhe aber die Farbe ist nicht die selbe was ich bestellt habe. Ich habe Blau/Weis ohne Schwarz bestellt.",
        "Muy cómodos y ligeros buena compra👍",
        "Muy duras para correr, para caminar pueden valer, poca amortiguación,zapatillas muy normalitas hay mejores marcas por ese dinero.",
        "The shoes were and advertised as breathable and supportive but even though it has a mesh look they are not breathable. The sole feels less rubbery and more plastic, they don't have any give and are not very flexible. I have done 3 5km runs in these and my feet have hurt after each run.",
        "The delivery was, perfect, the shoe is very comfortable, the only issue was the colour. It is not exactly grey. It is a khaki grey unlike the photos in the advertisement.",
        "No da las medidas detalladas",
        "Really good comfortable trainers and a great price for Prime Day but I signed up to Prime for next day delivery but these trainers didn't arrive until four days later which was a disappointment for Prime members paying each £8.99 per month for next day delivery.",
        "Fallen Eng am Fuß aus. Würde sie großer Bestellen oder andere Schuhe wählen",
        "Product reviews recommend ½ size bigger than normal. I would say 1 full size up ftom normal is about right",
        "La suela viene como pinchada y hace un ruido espantoso al andar, no compraré más a esta tienda."],
    "company_9": [
        "Complete trash, not even worthy to be sold at Dollar Store!",
        "They don't have much arch support",
        "the stitching is already coming out on the sides, I wont buy these again",
        "Great shoe, but, not workable for my 14 year old track runner. Perfect for normal everyday use except long distance running",
        "Comfortable when not broke …Heel area tore up and I only wore these shoes on walks/runs for 1.5 months. Didnt hold up well at all. Would love a replacement, but only a 30 day window.",
        "I liked the shoes, they were a great price and comfortable but they wore out within a few months. I still buy Asics shoes but I'm paying attention now to see if they come apart quickly.", "They hurt my feet I can't wear them. I've been using this brand for years and like their products but this shoe runs at least half a size small.",
        "After about three months of running, the mesh area started separating from the rest of the shoe so now they have holes. So they basically lasted about four months of constant running.",
        "It has become almost impossible to get a shoe that I like: My feet measure size 8. These at 9 felt too small. Maybe everyone else likes shoes to fit like compression socks; I don't.",
        "Obviously used. Bottom is black and I think the blade of grass gives it away. Not cool kemosabe",
        "I bought the extra wide, and have worn many other Asics in this size. These, for some reason, are just snug. So much so that my feet actually feel sore after an hour or so in them. To add to that, the tongue seems to be a bit narrow, because when I lace them up, my socks show through the gap on either side of the tongue, something I've never actually experienced in a shoe before. I'm not sure if I got a pair with QC issues or what, but they've been sitting in a closet since I got them, because they're flat out unwearable, even after trying diligently to break them in.", "The shoes are very lightweight, but the quality of the materials used just isn't there. They didn't last very long before my knees started hurting because all the cushion was gone.", "My toe has worn through the mesh top and the shoes are only a month old,Three days after the return date expired. I've had these shoes before and they were great. Seems like inferior materials were used.",
        "Shoelaces are cheap",
        "I’ve been buying this same series of shoe for many years and this is the first one for me where the insole is permanently glued into the shoe. As a wearer of custom orthotics, this is a non-starter but unfortunately I didn’t notice until I was past the return date. Otherwise it appears to be a fine shoe, consistent with previous models.it should also be noted that the factory insole is worthless if you require any amount of arch support. The insoles are basically flat.",
        "These may be fine for walking on a flat surface, but they're supposed to be for trail running and they're not ok for that. The biggest problem is that the insole has zero traction, so there's constant friction between the bottom of your foot and the shoe - so you're going to get blisters and the friction will actually burn holes in your socks. This is particularly problematic when descending trails. The other problem is poor arch support, but your feet are going to be on fire before your arches collapse. Anyway, not recommended at all.", "I've had version 6 and 7 of this shoe which were some of my favorites. There just don't fit the same and I'm not sure they are as well constructed.",
        "Having literally bought dozens of these same shoes over the past several years (new pair every three months), this pair was terrible. The heel cups inner padding detached within two weeks and wadded up near the footbed.",
        "Quality was too low",
        "Purchased 7/7/23 Started hurting my feet about a week after receiving so I purchased inserts it’s now 8/9/23 and I can no longer wear these shoes which are barely broken in. Feet are killing me after a couple hours in these. I’ve bought ASICS in the past and never had this so I think these are just a cheap version.",
        "I ordered a pair of these shoes last year and my first pair lasted a couple hundred miles I would guess (I wasn't using an app to track at the time). Eventually the heel of the shoe wore out causing blisters on the back of my feet. I thought for my amount of running the shoes were still a pretty good deal so I ordered another pair. I have had this pair for only about 2 months and only have about 75 miles on them and the heel is already worn out. Not sure if quality of the new ones is worse or if I just got a defective pair.  Working to put in a ticket with Asic support right now to see if they will help remedy the issue.",
        "Light but not a running shoe",
        "I ordered these in blue and later in green in the same size in green from the same seller and the same brand. They do not fit the same. The green ones are really tight around the large toe on the right foot.",
        "I have used ASICS Gel running shoes for years (like 15 years) but the last two batches of Gel Venture 8s have been a disaster. First, some sort of hard plastic is now used in the rear ankle area where the \"foxing\" of the shoe is - just below the pull tab. When the foam wears out (and it does, rapidly), the plastic bites into the skin making the shoe unusable. Second, the sole has worn out much faster that before causing the ball of the foot to start to ache. Third, the toe area fabric has worn out, likely because of a slightly different cut. In short, the shoe is unusable after three months - it is time to migrate to a different manufacturer.",
        "It's a comfortable shoe. I can feel the soul through the bottom of the shoe. Other than that, they are just fine. I think I'll stick with New Balance next time I purchase......",
        "I had a pair of these that were another color that fit fine. I felt pretty confident that ordering exactly the same model of shoe in the same size would insure good fit. These are smaller than my other pair. I can still walk in them, but they are almost too small for me to use. Otherwise, these shoes are great and really great for the price.",
        "I've had my pair for about 7 months and to my embarrassment they have not been used very much. Despite gentle use the toe seam came undone on my right shoe and grew into a hole that my toe can almost fit through. I love the fit of Asics and these are breathable and the treads grip well and shed mud nicely, but even at the economy level these fall short on construction. Shame.",
        "The shoes are very comfortable however I’ve only had these for about 2.5 months and there is already a hole in the top of the shoe. I work from home and do not even wear them everyday.",
        "Killed my feet felt like walking on pinsand needles",
        "It is an OK running shoe. It has a nice sole, support is ok. Not great, but satisfactory. But, the upper uses cheap glossy plastic. I am used to a more refined upper.",
        "I ordered a pair of NEW ASICS running shoes for a trip. I received a pair of USED New Balance shoes. Wasted my time and money.",
        "This is my second pair in the last few months. Within a little over 30 days (a few days after the return window closed), both pairs of shoes had holes I them on the mesh area on the top of the shoe.  Prior to this, I purchased four pairs of New Balance’s every year for a decade and never had this happen. A friend convinced me to try these. Don’t buy these.",
        "This said size 14, but it was really like a 15! Idk",
        "They didn’t last a month",
        "Wish this went better. When I received them there was odd lump under big toe that hurt. I reached out and was told in order to return them I would have to pay the restocking fee and then by them again. I explained that I did not feel I should have to pay the fee and was basically told to bad. I am beyond frustrated. I did not want to pay the fee I just wanted an even exchange. The customer service rep who said she was the manager was working from home with all sorts of nose in the background and not listening to me at all. She may have been reading a script for All I know. So disappointed. I still have these and had hoped they would break in like other shoe's however they are getting worst and since I have worn them out side I am stuck with them... not happy at all.",
        "But not for everyday use. I find myself slipping on flat wet floors, inside and outside, which sucks, but they are great for walking on trails and comfortable for most everyday use",
        "I’ve been wearing ASICS sneakers for 20 years and went through probably 50-60 pairs. These shoes are as good as ever. But this is the first time when instead of nice thick shoelaces, they came with cheap flat laces that go untied all the time. Luckily I have laces salvaged from old pairs, so I could replace them. But I think this cost cutting is a bad idea. If the next pair I buy comes with similarly poor laces, I will send it back.",
        "I’ve been buying this same shoe for several times and each time the 9.5 fit my feet well. On my recent order the same size shoe fitted about a size smaller. Not happy with whatever manufacturing issue ASICS is going through at the moment. Not buying this shoe online again.",
        "Too small, even though the inside says 14 these are definitely not size 14",
        "Liked the style but the size 10 was cut thin and short in the toe. Couldn’t wear them after 4 hours on my feet. But that’s buying shoes off the internet I guess.",
        "The reviews that say, “these run small, size up” aren’t wrong, but I don’t know if sizing a half-size up would help either. They are the exact same size as my other 2 Asics running shoes (which are great for me), but they do give the illusion that they run small because of the leather that is at the top of the shoe, covering the toe. I’ve run 50 miles in them now (about a months worth of running) and while they’ve broken in quite a bit, the leather is still irritating my toes and after running 5miles or so, I can’t wait to take them off. If you’re worried about the size, I’d go with another ASICS model. I am going to have to buy another model because these just arent working for me.",
        "I DONT RECOMEND FOR RUNNIG YOU CAN GET HURT EASILY. FOR WALKING MAYBE, THE COMFORT ITS NOT AS EXPECTED.",
        "Bought these for running and they are probably the worst pair I've purchased in some time. I do try to find good deals and I've had lunch with Altra's, Under Armors, Merrells, and New Balance running shoes, but these are just clunky and uncomfortable. I will be using these to mow the lawn instead of running.", "I don't know what it is about this shoe, but it just does not work. All other ASICS walking/running shoe works, but this one gave me a huge blister on the sole of my foot. This may be the second pair I have purchased and I think I returned the initial one. It could be my feet - but other ASICS work.",
        "The product has slight damage on the toe of the shoe. The box and packaging was completely destroyed and open when I received it. Also it was a day late",
        "Usually get 11's in sneakers, toes hitting the ends. Tight all around? I may need 11 And a 1/2 wides. If they were the right fit they're really nice. most likely give higher stars if I could fit in them:(",
        "Good product",
        "I have worn these shoes for a week now, and there is a MARKED difference in the cushioning from the previous generation. Halfway through my work shift and my heels are sore. The reason I buy ASICS is because they have wide shoes that fit my duck feet very well, and have a decently cushioned sole. They shouldn't need new insoles straight out of the box! I should also point out that the Gel-Venture 7 also had worse cushioning than the Gel-Venture 6, so there's a definite trend here. 🙄 I may have to look elsewhere in the future.",
        "I wear size 11-1/2. I ordered size 11-1/2. The shoes were delivered and marked size 11-1/2. They are too small. Way too small. At least a full size too small. Maybe more. Shipped via UPS. The nearest UPS store is 30 miles away. It would cost $7.99 for UPS to pick it up and return, so I had to make the long drive. Not worth it.",
        "This shoe started out great, I wore these shoes every day for a month AND 3 days after I could return, I noticed they a falling apart near the flex point on the left shoe. I wanted to return and try another pair becuase I want them to last! Darn, always looking for a NIKE replacement, still searching...",
        "Always get size 13 in Asics. These were to small.",
        "Anteriormente pedí una talla 9½ en un modelo muy similar (caña alta) y me quedó perfecta. Pero está vez pedí la misma talla y pareciera que es una talla menos a pesar que en la etiqueta dice 9½.",
        "I gave two weeks for the adjustments to my feet, but the toe area still still uncomfortable. Soles feel great, design is attractive and the shoe is sturdy",
        "I switched to this brand thinking it might be wide. I ordered X wide, absolutely not wide at all. I have worn regular width in other braids that were wider than this extra wide. Will never order this brand again. Very very unhappy!",
        "just a bit short/small compared to all my normal ASICS running shoes, but I'v tried to go with in/break them in. Overall, would not buy again", "These are weirdly terrible Asics. I've had many pairs of Asics. Most of the lower cost Asics do not have wonderful support. These seem ok but it turns out extensive walking in them is not a good idea, at least in my experience. I ended up with Achilles tendonitis and still haven't recovered. They cause heel pain easily. It's strange because they actually fit well and seem to provide ankle support and yet I ended up with an ankle-related injury.",
        "I bought may 25 of this year. I wear about every 2nd or 3rd day. Already has a hole in them! I only walk!",
        "I have two complaints: style and fit.  Firstly, let me notify you all about the fit. This shoe is larger than every other brand that I have owned for many, many years.  I am an 11 in Reebok Classic leather sneakers, an 11 in London fog high-top shoes, and a 10.5 in New Balance running shoes, Reebok Court Advance, and New Republic court shoes. I ordered a 10.5 in ASICS Gel-Venture 8, and they looked like clown shoes on my feet! Far too large! I laced them tightly using the extra holes, even, and despite all of my efforts, my feet still slid around in these shoes. I would need a size-10.  Having said that, I believe that a 10 is *actually* my true size! According to literal foot-length measurements. So ASICS is actually sizing correctly. But other brands have been making their shoes smaller, and smaller, as the years go on.  Now, I must talk about style. As a shoe, it seems okay. Seems durable. BEWARE, however, that the outsole is designed for earth - not for floors or asphalt. Now, this is important, because this shoe does not grip [indoor] gym floors and gym equipment as well as normal running shoes and cross-training shoes.  This is somewhere between a trail-running shoe and a regular running shoe, I would guess. Not a normal running shoe. It does not seem to have the typical waterproof features of trail-running shoes (I might be wrong), but other than that, I would say that it is a trail-running shoe, because of its outsole. Perhaps this shoe would be ideal on small-gravel paths, dry dusty trails, and the like. I would only recommend it if you plan to run on such paths.",
        "Please buy 1/2 a size larger than your normal size",
        "I bought these shoes April 2022 and have worn them lightly. To my surprise, the outer sole on the right shoe has become unglued and I’m unable to wear them any longer. I don’t think shoes are supposed to do this, especially nice ASICS like these. They were otherwise great shoes that were comfortable and I loved the color combination.",
        "Shape of shoe was wrong for my feet, they hurt. Returned",
        "Great look, great fit but slippery compound on some surfaces.",
        "I've had knee problems all my life, but these shoes make them worse. If I don't wear them for a week, my knees feel a lot better. If I start wearing them again, my knees ache and feel terrible. I'm actually impressed these shoes have such a noticeable impact on them. If you have knee issues, you should spend a little more on better shoes. Otherwise, these are fine shoes.",
        "I've ordered 2 pairs of \"ASICS Men's Gel-Contend 7 Running Shoes\" on Amazon in the past, getting 4E X-Wide and did not have an issue, they were actually X-Wide. I decided to try a new model this time and ordered these \"ASICS Men's Gel-Venture 8 Running Shoes\"; they're not even Wide, let alone X-Wide. My old pairs have wider soles than my feet because they're actually 4E X-Wide. These are so skinny my arches hang out over the soles on the inside by an obnoxious amount. They sent the right size shoes according to the tags and the box is marked 4E X-Wide but I've had standard, non-wide shoes in the past that have more arch coverage than these. If you need X-Wide, do not buy this model.",
        "This shoe has very poor traction on wet stone, concrete, wood, and metal. I would not recommend for city use",
        "I bought the shoes because of great reviews but the experience did not reflect on me.  I tried the shoes for a while and started to experience discomfort in the left front part of the foot. As I researched, I learned my symptoms are similar to metatarsal symptoms.  I bought foot cushions like \"Metatarsal Pad Ball\" and Dr. Scholl's all-purpose sport & fitness comfort insoles to mitigate the situation. These tools help a little.  When I wear my old sneakers like Mizuno Men's Wave Rider 24 Waveknit Running shoe, I don't have the discomfort.  I will not wear this Ascis even with cushions. Maybe it is only me.",
        "I love Asics but I disliked this particular shoe. The perpendicular zig-zag pattern on the sole hurt my feet after just a few short hours of light wear.  I'm a man of larger carriage (275 lbs) and it felt like all my weight was focused on the ball of my foot. Which was only supported by a single zig-zag.  The spacing on the design of the sole only placed one zig-zag near the ball of my foot. It felt like standing on broken pencils.  It was actually fairly painful and I could literally feel the zig-zag irritation on my feet for days after the one and only wear. So glad I tried them out before going on vacation.  I will be donating these to the shoe drive. Maybe a lighter person can get some use out of them.",
        "the traction is very poor on wet surfaces, including concrete and asphalt",
        "Ive been through many models of Ascics. I have a wide foot and wear a 10 4e. This model runs small. I thought they would break in and stretch out. The fit remains tight and small ,even after several months of wear.",
        "I bought these for walking. They’re terrible. I kept hoping they would break in. I ended up with an injury. I now use them to cut the yard in only. They’re heavy, clunky, hot.",
        "Bought his when ASICS Men's Gel-Venture 6 MX Running Shoes in my size was not available. Shoe is too tight in toes. Shoestrings are light weight, and not long enough to lace up top hole.",
        "The sneaker has good color combinations. I am tired of paying 150 dollars for a sneaker so I bought these. They look good but are not a comfortable shoe. Not enough padding or support. They are good for every day errands.",
        "The shoe was great till it wasn't. 6 months old and my toe has worn through the top of the shoe. I'm 75 years old - these shoes have not been worked hard! Asics needs to add some rubber across the toe area.",
        "La talla del zapato no es la correcta, esta un numero por arriba",
        "Bought because shoes were recommended for plantar fascitis. Previous revision I bought (Gel Venture 5) of this shoe seem more padded and supportive. They are ok and haven't aggravated my foot. Price was good as well.",
        "Yo uso la talla 12. (US) pero parece que la fabrican en Vietnam más chica. Debieran ofrecer entonces tallas intermedias. (12.5).",
        "Purchased these shoes on 3/5 and there are already holes in the shoes. I’m surprised bc ASICS normally has high quality shoes",
        "Compared to Asics shoes made in the US These appear to be cheaply made. I actually used socks shoved into the shoes to expand them enough around the side of my foot and small toe. I would immediately return any other shoes made overseas or designed so that the plastic around the shoe to support it interferes with the side of the foot or toes. These shoes are now falling apart at the heel. Ill never buy another pair of Asics. It took 6 months with socks stuffed in to get them to fit. They have been worn 6 months and they are garbage. I should have kept the 5 year old ones.",
        "Right at the widest point of your foot there is a big hard lump where two sections are sewn. If they had just taken the logo portion on down to the sole it wouldn't have been a problem but stopping it right at the stitching makes it a painful transition.  Really liked the shoes but after only 20 seconds I really started to feel it at that pressure point so they are going back.",
        "Still breaking in shoes, was hoping they had more support as using them as my daily walking shoes."],
    "company_10": [
        "I ordered this shoe for running. It looks cute, but feels cheap and absolutely no support. It might be good for an everyday shoe, but for running, no.",
        "I have wore ASICS for several years and this is my 3rd pair that I have ordered recently.Returned the other 2 and kept these because were the best of the 3 but not the same comfortable fit as all my previous ones. They do not fit like the Jolt 2 or my other ASICS, not as comfortable in toe box area. I will be searching for a new brand for walking and exercising.",
        "I’ve worn this brand for years and the wide width used to be right for me. This pair feels a little long and rubs my heel a little. The construction doesn’t feel as supportive as it used to.",
        "Had to return - I have used this brand shoe before and was absolutely in love with it and that’s how when I saw it with that price I add it to the cart in not time however ever it was an absolute disappointment when I open the box it was cheap made by and the fit was simply awful. I was very disappointed I won’t suggest anyone to buy it",
        "I have other ASICS shoes that are wonderful. This is not the same quality.",
        "I haven’t had these shoes for a year yet and there is already a hole starting in both shoes near the toes. Disappointing",
        "I haven’t had these shoes for a year yet and there is already a hole starting in both shoes near the toes. Disappointing",
        "I like the way these look and feel on, but despite that I’m throwing out because I’ve almost slipped and fallen so many times from the bottoms if there’s even hint off water. I don’t even want to donate them because they’re so slippery.",
        "Run small",
        "not as expected.",
        "no narrow sizes available, so I ordered a medium width and It was way too wide. had to return. seemed like a good shoe, if it had been narrow I probably would have kept it.",
        "I think it's finally time to admit Asics aren't made for my foot type. I have a high arch, which causes the top of my foot to be a little more pronounced in the tongue area. I've tried Asics in a range of sizes and styles, but I always have the same issue, they're too tight on the top of my foot and cause my toes to go numb. This only happens when exercising. I've tried lacing them differently to no avail. If I wear them to run errands, they're fine, though I do have to size up. I wear a size 8.5 Women's in New Balance sneakers, and I wear a size 9 in Asics. The shoes themselves are made well and feel comfy. I'm sad I can't wear them. Asics offers such fun colors.",
        "I usually get the gel excite model, they are super comfy as soon as I put them on. Amazon suggested this shoe instead, and at $35, why not try it? Well, they were a little loose and moving (even with the second top eye laced) as I walked and my feet hurt within minutes if not seconds. They are being returned and I ordered the gel excite 9. Hope those are better…..",
        "The media could not be loaded.",
        "My feet hurt when I wear them very hard to get on and off most uncomfortable shoe I have every bought",
        "I have tupe 2 Diabetes these shoe's have helped my feet.", "I wish I could be a better but it's not it hurt my feet horrible and i have sore spot on sole on my feet ... :(", "Zero upper support regardless of how tightly laced. Sole needs arch support because there is none. Heel cup is also not Asics standard firm cup. Have been buying this brand for a LONG time and via online for several years, that's how comfortable I am in brands quality. This version is way below usual standards. Glad I can go back and buy the older versions on Amazon.",
        "I was looking forward to using this shoe in wide , had re-purchased it for work. I was sorely disappointed when after opening the box to find that they were not Wide, though labeled as such. Completely different from the first pair I had ( everything ordered the same ). Now too late to return, and left with unusable shoes.",
        "This shoe is supposed to be wide width, but its slightly narrower than a Medium width  In general, the stitched join( Mesh fabric- leather) on top of toe box is weak and the stitching comes loose with a few wearings. Ascis need to use stronger thread for their stitches- very poor job for a reputable company. Leaves much to be desired. I can provide pictures if requested.",
        "This is the second pair I bought and the second pair to go back. Neither pair had Asics insoles. They are ortholite shoes which should have Asics ortholite insoles but they are not there. Whaaaat is going on? At least mention this fact in the ad.....",
        "I used these for three months at work and the top of the shoes started to get holes where the toes are located. The support is weak.",
        "Used for work",
        "Only worn it for under 4 months and the mesh has a hole. Not durable",
        "Shoe didn't fit. Completed a return, but could not get to UPS as I am on cytotoxic chemo drug and can't go anywhere.",
        "These give me bad blisters on the back of my feet",
        "son como plásticos",
        "I love the ASICS brand and was surprised at the lower cost so decided to try them from Amazon. Due to arthritis in my feet I needed to order a half size larger and needed a wide sneaker. I’ve worn these three times while walking and they are a very nice sneaker. BUT they are not WIDE. Not sure if it’s this ASICS style or not. The half size larger is good but there is no difference in the width from my previous pair.  An update on 2/27/23…donated the sneakers to Goodwill. Wore them two more times and because they were not wide enough they were rubbing my toes which made it difficult to walk in comfort. I really don’t understand how these sneakers could be labeled wide…that was on the box but not inside the tongue. Good thing they were inexpensive. Instead purchased Brooks Ghost 14 and so much better and definitely a wide width. Yes, more expensive, but it’s comfort that counts.",
        "They got torn in two month. Extremely bad quality",
        "Ordered size 10 wide, support of the foot is good, the issue is a 10 wide fits like a 9.5 rubs the pinky toe and leave rubs marks on the top of the foot too I have the shoestrings loose and the shoes still rub. If I hadn't already worn them at work for 5 shifts they would be going back for a refund. Buyer beware",
        "I regret these so much 🥲. These black shoes look fine but are horribly FLAT and you can’t walk in them. Terrible. Would not recommend!",
        "The shoes didn’t fit",
        "I bought these shoes for walking and I am very disappointed. The shoe itself is very comfortable, but I went for a walk yesterday and the soles are very inflexible and uncomfortable for walking. They feel clunky as you walk because the soles are so hard. I would return them if I hadn't worn them outside.",
        "Looks nice, sole is very hard and heavy, not very comfortable.",
        "I have worn a size 8 since I was 14 years old (17 years now wearing an 8) and when I put these on, my toes were immediately squished at the top. I thought they just needed to be worn in.. nope. Every time I wear them, they squeeze the everliving daylights out of my toes and I can't wait to take them off again so I only use them for when I need to quickly throw a pair on to go outside for a minute. I wouldn't wear these for longer than 20 mins at a time. I also thought it would have arch support (I'm 100% flat footed) and my area where my arch should be aches every time I take them off. The only thing I really liked about them was the color. I give these ⭐⭐⭐ (3) out of ⭐⭐⭐⭐⭐(5)",
        "Cheap",
        "Cute but too bulky",
        "Got these shoes for my mom as she wanted to start walking around the neighborhood. Quality itself I think it could've been better. I guess for the price, it cant use better quality. However, everything else I thought it was decent.",
        "Very uncomfortable",
        "It fits properly but is too stiff to be comfortable.",
        "If the toe area didn't narrow so much, I could have ordered a half size smaller. While the label doesn't say so, the left shoe feels to be a narrower width than the right.",
        "For work ,I work 12 hours a day",
        "A lot of cushion when you walk but the Wide Width isn’t wider. Disappointed",
        "I really love Asics so I bought 3 different pair of these. One I returned because there was a flaw in the stitching that rubbed my foot raw. The other two were very uncomfortable but I kept because I had to wear them a couple of times. These are NOT the same as the ASICS I buy in the store. I was so disappointed. But the colors are cute.",
        "DO NOT BUY! These shoes started falling apart in less than 2 months. Most of the stitching came apart and the sole of the shoe is bad. I compared it the real ASICS and these are trash. Buyer Beware.",
        "Color is great. Nice looking shoe. Runs about half a size small. Sole is stiffer than Nike or adidas.",
        "I wear these to my work",
        "I usually LOVE asics, they're my go to shoe. But with this pair in particular, I don't know maybe they were just part of a bad batch. When I first stuck my right foot in the shoe (literally the first ever time) it pushed down The back part of the shoe. And ever since then the inside plastic-y part has been like bent and folded down and no matter what I do I can't straighten it out. So it's always kind of pushing in on the back of my ankle, which is very very uncomfortable and annoying. Maybe I just got unlucky with a bad pair but this has happened once or twice in the past with asics.",
        "I use them as my exercising shoes. They lack heel support but they have good support in the arch. They are lightweight and have good air ventilation across the top of the shoe. They’re a good pair of shoes for their price range.",
        "I just purchased this shoe January 6, 2022. I love the style and it's super comfortable, but the mesh fabric has a hole at the toe already. This is the second pair I've purchased. The first pair also got a hole in the toe area. I thought it was because of something I did, but now I see it's a defect in the design of the shoe.",
        "The shoes have very little cushion and are very hard even after wearing a few times. Not comfortable as asics generally are.",
        "Dolor en el talón",
        "Can't wear them. No support. These hurt my feet", "First time buying online sneakers. I went a size up just in case. Typically 10W bought 11W. As soon as I pulled them out I knew they would be narrow what I didn't expect was my toes hit the top of the shoe. They are small for an 11. No wiggle room at all. Hoping that by breaking them in they'll fit better. Will never buy online sneakers again.",
        "I ordered my usual size 9. These shoes feel more like 8.5. They are too short and too narrow for my 9M feet. Very disappointing.",
        "Purchased Oct. 2021, today... May 2022...the seam is coming loose around the top of both sneakers. Are these authentic? If so, very poor craftsmanship. EXTREMELY DISAPPOINTED",
        "The threads are coming undone on the toe. Now there is a hole and the shoe needs to be thrown out. Usually I have gotten 2+ years out of ASICS tennis shoes, these only got four months out of. Very disappointing. Wish I could I return.",
        "There is no cushion and its hurts my feet so badly.",
        "I liked these shoes, but I ordered my usual size 7.5 and they were to small. They didn't have a 8 in stock. So I returned them. I found out Asics run a half size small.",
        "It fits well for work not a great as a running shoe",
        "Not quite the shoe I expected, since I have worn ASICS for years and have had a much more substantial feel.",
        "I'm really disappointed. There's a hole in the breathable fabric in less than 3 months. I've had better luck with cheap Walmart shoes. The pros: it's a comfortable shoe and I like the tread on the bottom of the shoe. Fits true to size. But now I look like a slob with a ripped shoe until I can find a replacement and shoes aren't cheap.",
        "My feet were achy and sore after my first 2 mile walk",
        "Asics shoes are always great, but I decided to return as I ended up not liking the color/style. I was totally disappointed that they charged $6 for return....especially since I had to print and package the item and drop it off at UPS. With so many free return options or at least drop off with QR codes, etc. I found this return to be cumbersome and outdated. While I remain a fan of Asics shoes, I will not buy Asics from Amazon again, but instead, will find store face that would accommodate free return/exchange.",
        "Sent it back",
        "The shoe looks more like an umpire than any type of femininity even though it’s black I expected it to look more like the other ASICS I have",
        "Desperate to find new shoes for work, always loved asics and been a challenge finding ones that arent terribly overpriced or out of stock in these times. My pinky toe broke through my old shoes so this time i ordered the WIDE version to see if it would help. I will say that i question if these shoes really are wide fit as i see little to no difference between my non-wide i ordered in another color. (see photo) Haven't worn yet but hoping these will last longer than my old ones, that wore out in less than 2 years of everyday wear. I worry about the quality of these shoes and am not hopeful of them lasting long as the 'tongue' of the shoe is significantly thinner than my old asics, seems like they dropped in quality. Unless this type is supposed to be like that, my old shoes were gel contend 5 type.  For any first time buyers for asics they do run slightly smaller so order a half size up. I normally wear a 9 but need a 9 1/2 in these.",
        "Didn't last more than a month got a hole in fabric",
        "No me duraron ni 6 meses y se rompieron 😕"
    ]
}